{
  "paper": {
    "id": "2104.09864v5",
    "title": "RoFormer: Enhanced Transformer with Rotary Position Embedding",
    "abstract": "Position encoding recently has shown effective in the transformer architecture. It enables valuable supervision for dependency modeling between elements at different positions of the sequence. In this paper, we first investigate various methods to integrate positional information into the learning process of transformer-based language models. Then, we propose a novel method named Rotary Position Embedding(RoPE) to effectively leverage the positional information. Specifically, the proposed RoPE encodes the absolute position with a rotation matrix and meanwhile incorporates the explicit relative position dependency in self-attention formulation. Notably, RoPE enables valuable properties, including the flexibility of sequence length, decaying inter-token dependency with increasing relative distances, and the capability of equipping the linear self-attention with relative position encoding. Finally, we evaluate the enhanced transformer with rotary position embedding, also called RoFormer, on various long text classification benchmark datasets. Our experiments show that it consistently overcomes its alternatives. Furthermore, we provide a theoretical analysis to explain some experimental results. RoFormer is already integrated into Huggingface: \\url{https://huggingface.co/docs/transformers/model_doc/roformer}.",
    "authors": [
      "Jianlin Su",
      "Yu Lu",
      "Shengfeng Pan",
      "Ahmed Murtadha",
      "Bo Wen",
      "Yunfeng Liu"
    ],
    "published": "2021-04-20T09:54:06.000Z",
    "updated": "2023-11-08T13:36:32.000Z",
    "primaryCategory": "cs.CL",
    "categories": [
      "cs.CL",
      "cs.AI",
      "cs.LG"
    ],
    "pdfUrl": "https://arxiv.org/pdf/2104.09864v5",
    "absUrl": "https://arxiv.org/abs/2104.09864v5"
  },
  "chunks": [
    {
      "id": "2104.09864v5-chunk-0",
      "content": "Zhuiyi Technology Co., Ltd. Shenzhen bojonesu@wezhuiyi.com\n\nAhmed Murtadha Zhuiyi Technology Co., Ltd. Shenzhen mengjiayi@wezhuiyi.com",
      "metadata": {
        "source": "arxiv:2104.09864v5",
        "title": "RoFormer: Enhanced Transformer with Rotary Position Embedding",
        "authors": [
          "Jianlin Su",
          "Yu Lu",
          "Shengfeng Pan",
          "Ahmed Murtadha",
          "Bo Wen",
          "Yunfeng Liu"
        ],
        "section": "Jianlin Su",
        "chunkIndex": 0,
        "totalChunks": 71
      }
    },
    {
      "id": "2104.09864v5-chunk-1",
      "content": "Zhuiyi Technology Co., Ltd. Shenzhen julianlu@wezhuiyi.com\n\nBo Wen Zhuiyi Technology Co., Ltd.\n\nShenzhen brucewen@wezhuiyi.com\n\nNovember 9, 2023",
      "metadata": {
        "source": "arxiv:2104.09864v5",
        "title": "RoFormer: Enhanced Transformer with Rotary Position Embedding",
        "authors": [
          "Jianlin Su",
          "Yu Lu",
          "Shengfeng Pan",
          "Ahmed Murtadha",
          "Bo Wen",
          "Yunfeng Liu"
        ],
        "section": "Yu Lu",
        "chunkIndex": 1,
        "totalChunks": 71
      }
    },
    {
      "id": "2104.09864v5-chunk-2",
      "content": "Position encoding recently has shown effective in the transformer architecture. It enables valuable supervision for dependency modeling between elements at different positions of the sequence. In this paper, we first investigate various methods to integrate positional information into the learning process of transformer-based language models. Then, we propose a novel method named Rotary Position Embedding(RoPE) to effectively leverage the positional information. Specifically, the proposed RoPE encodes the absolute position with a rotation matrix and meanwhile incorporates the explicit relative position dependency in self-attention formulation. Notably, RoPE enables valuable properties, including the flexibility of sequence length, decaying inter-token dependency with increasing relative distances, and the capability of equipping the linear self-attention with relative position encoding.",
      "metadata": {
        "source": "arxiv:2104.09864v5",
        "title": "RoFormer: Enhanced Transformer with Rotary Position Embedding",
        "authors": [
          "Jianlin Su",
          "Yu Lu",
          "Shengfeng Pan",
          "Ahmed Murtadha",
          "Bo Wen",
          "Yunfeng Liu"
        ],
        "section": "ABSTRACT",
        "chunkIndex": 2,
        "totalChunks": 71
      }
    },
    {
      "id": "2104.09864v5-chunk-3",
      "content": "uding the flexibility of sequence length, decaying inter-token dependency with increasing relative distances, and the capability of equipping the linear self-attention with relative position encoding. Finally, we evaluate the enhanced transformer with rotary position embedding, also called RoFormer, on various long text classification benchmark datasets. Our experiments show that it consistently overcomes its alternatives. Furthermore, we provide a theoretical analysis to explain some experimental results. RoFormer is already integrated into Huggingface: https://huggingface.co/docs/transformers/model\\_doc/roformer .\n\nKeywords Pre-trained Language Models · Position Information Encoding · Pre-training · Natural Language Processing.",
      "metadata": {
        "source": "arxiv:2104.09864v5",
        "title": "RoFormer: Enhanced Transformer with Rotary Position Embedding",
        "authors": [
          "Jianlin Su",
          "Yu Lu",
          "Shengfeng Pan",
          "Ahmed Murtadha",
          "Bo Wen",
          "Yunfeng Liu"
        ],
        "section": "ABSTRACT",
        "chunkIndex": 3,
        "totalChunks": 71
      }
    },
    {
      "id": "2104.09864v5-chunk-4",
      "content": "The sequential order of words is of great value to natural language understanding. Recurrent neural networks (RRNs) based models encode tokens' order by recursively computing a hidden state along the time dimension. Convolution neural networks (CNNs) based models (CNNs) Gehring et al. [2017] were typically considered position-agnostic, but recent work Islam et al. [2020] has shown that the commonly used padding operation can implicitly learn position information. Recently, the pre-trained language models (PLMs), which were built upon the transformer Vaswani et al. [2017], have achieved the state-of-the-art performance of various natural language processing (NLP) tasks, including context representation learning Devlin et al. [2019], machine translation Vaswani et al. [2017], and language modeling Radford et al. [2019], to name a few. Unlike, RRNs and CNNs-based models, PLMs utilize the self-attention mechanism to semantically capture the contextual representation of a given corpus.",
      "metadata": {
        "source": "arxiv:2104.09864v5",
        "title": "RoFormer: Enhanced Transformer with Rotary Position Embedding",
        "authors": [
          "Jianlin Su",
          "Yu Lu",
          "Shengfeng Pan",
          "Ahmed Murtadha",
          "Bo Wen",
          "Yunfeng Liu"
        ],
        "section": "1 Introduction",
        "chunkIndex": 4,
        "totalChunks": 71
      }
    },
    {
      "id": "2104.09864v5-chunk-5",
      "content": "ge modeling Radford et al. [2019], to name a few. Unlike, RRNs and CNNs-based models, PLMs utilize the self-attention mechanism to semantically capture the contextual representation of a given corpus. As a consequence, PLMs achieve a significant improvement in terms of parallelization over RNNs and improve the modeling ability of longer intra-token relations compared to CNNs 1 .\n\n1 A stack of multiple CNN layers can also capture longer intra-token relation, here we only consider single layer setting.",
      "metadata": {
        "source": "arxiv:2104.09864v5",
        "title": "RoFormer: Enhanced Transformer with Rotary Position Embedding",
        "authors": [
          "Jianlin Su",
          "Yu Lu",
          "Shengfeng Pan",
          "Ahmed Murtadha",
          "Bo Wen",
          "Yunfeng Liu"
        ],
        "section": "1 Introduction",
        "chunkIndex": 5,
        "totalChunks": 71
      }
    },
    {
      "id": "2104.09864v5-chunk-6",
      "content": "Zhuiyi Technology Co., Ltd. Shenzhen nickpan@wezhuiyi.com\n\nYunfeng Liu Zhuiyi Technology Co., Ltd. Shenzhen glenliu@wezhuiyi.com\n\nIt is noteworthy that the self-attention architecture of the current PLMs has shown to be position-agnostic Yun et al. [2020]. Following this claim, various approaches have been proposed to encode the position information into the learning process. On one side, generated absolute position encoding through a pre-defined function Vaswani et al. [2017] was added to the contextual representations, while a trainable absolute position encoding Gehring et al. [2017], Devlin et al. [2019], Lan et al. [2020], Clark et al. [2020], Radford et al. [2019], Radford and Narasimhan [2018]. On the other side, the previous work Parikh et al. [2016], Shaw et al. [2018], Huang et al. [2018], Dai et al. [2019], Yang et al. [2019], Raffel et al. [2020], Ke et al. [2020], He et al. [2020], Huang et al.",
      "metadata": {
        "source": "arxiv:2104.09864v5",
        "title": "RoFormer: Enhanced Transformer with Rotary Position Embedding",
        "authors": [
          "Jianlin Su",
          "Yu Lu",
          "Shengfeng Pan",
          "Ahmed Murtadha",
          "Bo Wen",
          "Yunfeng Liu"
        ],
        "section": "Shengfeng Pan",
        "chunkIndex": 6,
        "totalChunks": 71
      }
    },
    {
      "id": "2104.09864v5-chunk-7",
      "content": "her side, the previous work Parikh et al. [2016], Shaw et al. [2018], Huang et al. [2018], Dai et al. [2019], Yang et al. [2019], Raffel et al. [2020], Ke et al. [2020], He et al. [2020], Huang et al. [2020] focuses on relative position encoding, which typically encodes the relative position information into the attention mechanism. In addition to these approaches, the authors of Liu et al. [2020] have proposed to model the dependency of position encoding from the perspective of Neural ODE Chen et al. [2018a], and the authors of Wang et al. [2020] have proposed to model the position information in complex space. Despite the effectiveness of these approaches, they commonly add the position information to the context representation and thus render them unsuitable for the linear self-attention architecture.",
      "metadata": {
        "source": "arxiv:2104.09864v5",
        "title": "RoFormer: Enhanced Transformer with Rotary Position Embedding",
        "authors": [
          "Jianlin Su",
          "Yu Lu",
          "Shengfeng Pan",
          "Ahmed Murtadha",
          "Bo Wen",
          "Yunfeng Liu"
        ],
        "section": "Shengfeng Pan",
        "chunkIndex": 7,
        "totalChunks": 71
      }
    },
    {
      "id": "2104.09864v5-chunk-8",
      "content": "ace. Despite the effectiveness of these approaches, they commonly add the position information to the context representation and thus render them unsuitable for the linear self-attention architecture.\n\nIn this paper, we introduce a novel method, namely Rotary Position Embedding(RoPE), to leverage the positional information into the learning process of PLMS. Specifically, RoPE encodes the absolute position with a rotation matrix and meanwhile incorporates the explicit relative position dependency in self-attention formulation. Note that the proposed RoPE is prioritized over the existing methods through valuable properties, including the sequence length flexibility, decaying inter-token dependency with increasing relative distances, and the capability of equipping the linear self-attention with relative position encoding.",
      "metadata": {
        "source": "arxiv:2104.09864v5",
        "title": "RoFormer: Enhanced Transformer with Rotary Position Embedding",
        "authors": [
          "Jianlin Su",
          "Yu Lu",
          "Shengfeng Pan",
          "Ahmed Murtadha",
          "Bo Wen",
          "Yunfeng Liu"
        ],
        "section": "Shengfeng Pan",
        "chunkIndex": 8,
        "totalChunks": 71
      }
    },
    {
      "id": "2104.09864v5-chunk-9",
      "content": "ncluding the sequence length flexibility, decaying inter-token dependency with increasing relative distances, and the capability of equipping the linear self-attention with relative position encoding. Experimental results on various long text classification benchmark datasets show that the enhanced transformer with rotary position embedding, namely RoFormer, can give better performance compared to baseline alternatives and thus demonstrates the efficacy of the proposed RoPE.\n\nIn brief, our contributions are three-folds as follows:\n\n- We investigated the existing approaches to the relative position encoding and found that they are mostly built based on the idea of the decomposition of adding position encoding to the context representations. We introduce a novel method, namely Rotary Position Embedding(RoPE), to leverage the positional information into the learning process of PLMS.",
      "metadata": {
        "source": "arxiv:2104.09864v5",
        "title": "RoFormer: Enhanced Transformer with Rotary Position Embedding",
        "authors": [
          "Jianlin Su",
          "Yu Lu",
          "Shengfeng Pan",
          "Ahmed Murtadha",
          "Bo Wen",
          "Yunfeng Liu"
        ],
        "section": "Shengfeng Pan",
        "chunkIndex": 9,
        "totalChunks": 71
      }
    },
    {
      "id": "2104.09864v5-chunk-10",
      "content": "adding position encoding to the context representations. We introduce a novel method, namely Rotary Position Embedding(RoPE), to leverage the positional information into the learning process of PLMS. The key idea is to encode relative position by multiplying the context representations with a rotation matrix with a clear theoretical interpretation.\n- We study the properties of RoPE and show that it decays with the relative distance increased, which is desired for natural language encoding. We kindly argue that previous relative position encoding-based approaches are not compatible with linear self-attention.\n- We evaluate the proposed RoFormer on various long text benchmark datasets. Our experiments show that it consistently achieves better performance compared to its alternatives. Some experiments with pre-trained language models are available on GitHub: https://github.com/ZhuiyiTechnology/roformer .",
      "metadata": {
        "source": "arxiv:2104.09864v5",
        "title": "RoFormer: Enhanced Transformer with Rotary Position Embedding",
        "authors": [
          "Jianlin Su",
          "Yu Lu",
          "Shengfeng Pan",
          "Ahmed Murtadha",
          "Bo Wen",
          "Yunfeng Liu"
        ],
        "section": "Shengfeng Pan",
        "chunkIndex": 10,
        "totalChunks": 71
      }
    },
    {
      "id": "2104.09864v5-chunk-11",
      "content": "that it consistently achieves better performance compared to its alternatives. Some experiments with pre-trained language models are available on GitHub: https://github.com/ZhuiyiTechnology/roformer .\n\nThe remaining of the paper is organized as follows. We establish a formal description of the position encoding problem in self-attention architecture and revisit previous works in Section (2) . We then describe the rotary position encoding (RoPE) and study its properties in Section (3) . We report experiments in Section (4) . Finally, we conclude this paper in Section (5) .",
      "metadata": {
        "source": "arxiv:2104.09864v5",
        "title": "RoFormer: Enhanced Transformer with Rotary Position Embedding",
        "authors": [
          "Jianlin Su",
          "Yu Lu",
          "Shengfeng Pan",
          "Ahmed Murtadha",
          "Bo Wen",
          "Yunfeng Liu"
        ],
        "section": "Shengfeng Pan",
        "chunkIndex": 11,
        "totalChunks": 71
      }
    },
    {
      "id": "2104.09864v5-chunk-12",
      "content": "Let S N = { w i } N i =1 be a sequence of N input tokens with w i being the i th element. The corresponding word embedding of S N is denoted as E N = { x i } N i =1 , where x i ∈ R d is the d-dimensional word embedding vector of token w i without position information. The self-attention first incorporates position information to the word embeddings and transforms them into queries, keys, and value representations.\n\n<!-- formula-not-decoded -->\n\nwhere q m , k n and v n incorporate the m th and n th positions through f q , f k and f v , respectively. The query and key values are then used to compute the attention weights, while the output is computed as the weighted sum over the value\n\nrepresentation.\n\n<!-- formula-not-decoded -->\n\nThe existing approaches of transformer-based position encoding mainly focus on choosing a suitable function to form Equation (1).",
      "metadata": {
        "source": "arxiv:2104.09864v5",
        "title": "RoFormer: Enhanced Transformer with Rotary Position Embedding",
        "authors": [
          "Jianlin Su",
          "Yu Lu",
          "Shengfeng Pan",
          "Ahmed Murtadha",
          "Bo Wen",
          "Yunfeng Liu"
        ],
        "section": "2.1 Preliminary",
        "chunkIndex": 12,
        "totalChunks": 71
      }
    },
    {
      "id": "2104.09864v5-chunk-13",
      "content": "A typical choice of Equation (1) is\n\n<!-- formula-not-decoded -->\n\nwhere p i ∈ R d is a d-dimensional vector depending of the position of token x i . Previous work Devlin et al. [2019], Lan et al. [2020], Clark et al. [2020], Radford et al. [2019], Radford and Narasimhan [2018] introduced the use of a set of trainable vectors p i ∈ { p t } L t =1 , where L is the maximum sequence length. The authors of Vaswani et al. [2017] have proposed to generate p i using the sinusoidal function.\n\n<!-- formula-not-decoded -->\n\nin which p i, 2 t is the 2 t th element of the d-dimensional vector p i . In the next section, we show that our proposed RoPE is related to this intuition from the sinusoidal function perspective. However, instead of directly adding the position to the context representation, RoPE proposes to incorporate the relative position information by multiplying with the sinusoidal functions.",
      "metadata": {
        "source": "arxiv:2104.09864v5",
        "title": "RoFormer: Enhanced Transformer with Rotary Position Embedding",
        "authors": [
          "Jianlin Su",
          "Yu Lu",
          "Shengfeng Pan",
          "Ahmed Murtadha",
          "Bo Wen",
          "Yunfeng Liu"
        ],
        "section": "2.2 Absolute position embedding",
        "chunkIndex": 13,
        "totalChunks": 71
      }
    },
    {
      "id": "2104.09864v5-chunk-14",
      "content": "The authors of Shaw et al. [2018] applied different settings of Equation (1) as following:\n\n<!-- formula-not-decoded -->\n\nwhere ˜ p k r , ˜ p v r ∈ R d are trainable relative position embeddings. Note that r = clip( m -n, r min , r max ) represents the relative distance between position m and n . They clipped the relative distance with the hypothesis that precise relative position information is not useful beyond a certain distance. Keeping the form of Equation (3), the authors Dai et al. [2019] have proposed to decompose q ⊺ m k n of Equation (2) as\n\n<!-- formula-not-decoded -->\n\nthe key idea is to replace the absolute position embedding p n with its sinusoid-encoded relative counterpart ˜ p m -n , while the absolute position p m in the third and fourth term with two trainable vectors u and v independent of the query positions. Further, W k is distinguished for the content-based and location-based key vectors x n and p n , denoted as W k and ˜ W k , resulting in:",
      "metadata": {
        "source": "arxiv:2104.09864v5",
        "title": "RoFormer: Enhanced Transformer with Rotary Position Embedding",
        "authors": [
          "Jianlin Su",
          "Yu Lu",
          "Shengfeng Pan",
          "Ahmed Murtadha",
          "Bo Wen",
          "Yunfeng Liu"
        ],
        "section": "2.3 Relative position embedding",
        "chunkIndex": 14,
        "totalChunks": 71
      }
    },
    {
      "id": "2104.09864v5-chunk-15",
      "content": "trainable vectors u and v independent of the query positions. Further, W k is distinguished for the content-based and location-based key vectors x n and p n , denoted as W k and ˜ W k , resulting in:\n\n<!-- formula-not-decoded -->\n\nIt is noteworthy that the position information in the value term is removed by setting f v ( x j ) := W v x j . Later work Raffel et al. [2020], He et al. [2020], Ke et al. [2020], Huang et al. [2020] followed these settings by only encoding the relative position information into the attention weights. However, the authors of Raffel et al. [2020] reformed Equation (6) as:\n\n<!-- formula-not-decoded -->\n\nwhere b i,j is a trainable bias. The authors of Ke et al. [2020] investigated the middle two terms of Equation (6) and found little correlations between absolute positions and words. The authors of Raffel et al. [2020] proposed to model a pair of words or positions using different projection matrices.\n\n<!-- formula-not-decoded -->",
      "metadata": {
        "source": "arxiv:2104.09864v5",
        "title": "RoFormer: Enhanced Transformer with Rotary Position Embedding",
        "authors": [
          "Jianlin Su",
          "Yu Lu",
          "Shengfeng Pan",
          "Ahmed Murtadha",
          "Bo Wen",
          "Yunfeng Liu"
        ],
        "section": "2.3 Relative position embedding",
        "chunkIndex": 15,
        "totalChunks": 71
      }
    },
    {
      "id": "2104.09864v5-chunk-16",
      "content": "correlations between absolute positions and words. The authors of Raffel et al. [2020] proposed to model a pair of words or positions using different projection matrices.\n\n<!-- formula-not-decoded -->\n\nThe authors of He et al. [2020] argued that the relative positions of two tokens could only be fully modeled using the middle two terms of Equation (6). As a consequence, the absolute position embeddings p m and p n were simply replaced with the relative position embeddings ˜ p m -n :\n\n<!-- formula-not-decoded -->\n\nA comparison of the four variants of the relative position embeddings Radford and Narasimhan [2018] has shown that the variant similar to Equation (10) is the most efficient among the other three. Generally speaking, all these approaches attempt to modify Equation (6) based on the decomposition of Equation (3) under the self-attention settings in Equation (2), which was originally proposed in Vaswani et al. [2017].",
      "metadata": {
        "source": "arxiv:2104.09864v5",
        "title": "RoFormer: Enhanced Transformer with Rotary Position Embedding",
        "authors": [
          "Jianlin Su",
          "Yu Lu",
          "Shengfeng Pan",
          "Ahmed Murtadha",
          "Bo Wen",
          "Yunfeng Liu"
        ],
        "section": "2.3 Relative position embedding",
        "chunkIndex": 16,
        "totalChunks": 71
      }
    },
    {
      "id": "2104.09864v5-chunk-17",
      "content": "ll these approaches attempt to modify Equation (6) based on the decomposition of Equation (3) under the self-attention settings in Equation (2), which was originally proposed in Vaswani et al. [2017]. They commonly introduced to directly add the position information to the context representations. Unlikely, our approach aims to derive the relative position encoding from Equation (1) under some constraints. Next, we show that the derived approach is more interpretable by incorporating relative position information with the rotation of context representations.",
      "metadata": {
        "source": "arxiv:2104.09864v5",
        "title": "RoFormer: Enhanced Transformer with Rotary Position Embedding",
        "authors": [
          "Jianlin Su",
          "Yu Lu",
          "Shengfeng Pan",
          "Ahmed Murtadha",
          "Bo Wen",
          "Yunfeng Liu"
        ],
        "section": "2.3 Relative position embedding",
        "chunkIndex": 17,
        "totalChunks": 71
      }
    },
    {
      "id": "2104.09864v5-chunk-18",
      "content": "In this section, we discuss the proposed rotary position embedding (RoPE). We first formulate the relative position encoding problem in Section (3.1) , we then derive the RoPE in Section (3.2) and investigate its properties in Section (3.3) .",
      "metadata": {
        "source": "arxiv:2104.09864v5",
        "title": "RoFormer: Enhanced Transformer with Rotary Position Embedding",
        "authors": [
          "Jianlin Su",
          "Yu Lu",
          "Shengfeng Pan",
          "Ahmed Murtadha",
          "Bo Wen",
          "Yunfeng Liu"
        ],
        "section": "3 Proposed approach",
        "chunkIndex": 18,
        "totalChunks": 71
      }
    },
    {
      "id": "2104.09864v5-chunk-19",
      "content": "Transformer-based language modeling usually leverages the position information of individual tokens through a selfattention mechanism. As can be observed in Equation (2), q ⊺ m k n typically enables knowledge conveyance between tokens at different positions. In order to incorporate relative position information, we require the inner product of query q m and key k n to be formulated by a function g , which takes only the word embeddings x m , x n , and their relative position m -n as input variables. In other words, we hope that the inner product encodes position information only in the relative form:\n\n<!-- formula-not-decoded -->\n\nThe ultimate goal is to find an equivalent encoding mechanism to solve the functions f q ( x m , m ) and f k ( x n , n ) to conform the aforementioned relation.",
      "metadata": {
        "source": "arxiv:2104.09864v5",
        "title": "RoFormer: Enhanced Transformer with Rotary Position Embedding",
        "authors": [
          "Jianlin Su",
          "Yu Lu",
          "Shengfeng Pan",
          "Ahmed Murtadha",
          "Bo Wen",
          "Yunfeng Liu"
        ],
        "section": "3.1 Formulation",
        "chunkIndex": 19,
        "totalChunks": 71
      }
    },
    {
      "id": "2104.09864v5-chunk-20",
      "content": "We begin with a simple case with a dimension d = 2 . Under these settings, we make use of the geometric property of vectors on a 2D plane and its complex form to prove (refer Section (3.4.1) for more details) that a solution to our formulation Equation (11) is:\n\n<!-- formula-not-decoded -->\n\nwhere Re[ · ] is the real part of a complex number and ( W k x n ) ∗ represents the conjugate complex number of ( W k x n ) . θ ∈ R is a preset non-zero constant. We can further write f { q,k } in a multiplication matrix:\n\n<!-- formula-not-decoded -->\n\nwhere ( x (1) m , x (2) m ) is x m expressed in the 2D coordinates. Similarly, g can be viewed as a matrix and thus enables the solution of formulation in Section (3.1) under the 2D case. Specifically, incorporating the relative position embedding is straightforward: simply rotate the affine-transformed word embedding vector by amount of angle multiples of its position index and thus interprets the intuition behind Rotary Position Embedding .",
      "metadata": {
        "source": "arxiv:2104.09864v5",
        "title": "RoFormer: Enhanced Transformer with Rotary Position Embedding",
        "authors": [
          "Jianlin Su",
          "Yu Lu",
          "Shengfeng Pan",
          "Ahmed Murtadha",
          "Bo Wen",
          "Yunfeng Liu"
        ],
        "section": "3.2.1 A 2D case",
        "chunkIndex": 20,
        "totalChunks": 71
      }
    },
    {
      "id": "2104.09864v5-chunk-21",
      "content": "In order to generalize our results in 2D to any x i ∈ R d where d is even, we divide the d-dimension space into d/ 2 sub-spaces and combine them in the merit of the linearity of the inner product, turning f { q,k } into:\n\n<!-- formula-not-decoded -->\n\nwhere\n\n<!-- formula-not-decoded -->\n\nis the rotary matrix with pre-defined parameters Θ = { θ i = 10000 -2( i -1) /d , i ∈ [1 , 2 , ..., d/ 2] } . A graphic illustration of RoPE is shown in Figure (1) . Applying our RoPE to self-attention in Equation (2), we obtain:\n\n<!-- formula-not-decoded -->\n\nwhere R d Θ ,n -m = ( R d Θ ,m ) ⊺ R d Θ ,n . Note that R d Θ is an orthogonal matrix, which ensures stability during the process of encoding position information. In addition, due to the sparsity of R d Θ , applying matrix multiplication directly as in Equation (16) is not computationally efficient; we provide another realization in theoretical explanation.",
      "metadata": {
        "source": "arxiv:2104.09864v5",
        "title": "RoFormer: Enhanced Transformer with Rotary Position Embedding",
        "authors": [
          "Jianlin Su",
          "Yu Lu",
          "Shengfeng Pan",
          "Ahmed Murtadha",
          "Bo Wen",
          "Yunfeng Liu"
        ],
        "section": "3.2.2 General form",
        "chunkIndex": 21,
        "totalChunks": 71
      }
    },
    {
      "id": "2104.09864v5-chunk-22",
      "content": "on. In addition, due to the sparsity of R d Θ , applying matrix multiplication directly as in Equation (16) is not computationally efficient; we provide another realization in theoretical explanation.\n\nIn contrast to the additive nature of position embedding method adopted in the previous works, i.e., Equations (3) to (10), our approach is multiplicative. Moreover, RoPE naturally incorporates relative position information through rotation matrix product instead of altering terms in the expanded formulation of additive position encoding when applied with self-attention.\n\nFigure 1: Implementation of Rotary Position Embedding(RoPE).\n\n<!-- image -->",
      "metadata": {
        "source": "arxiv:2104.09864v5",
        "title": "RoFormer: Enhanced Transformer with Rotary Position Embedding",
        "authors": [
          "Jianlin Su",
          "Yu Lu",
          "Shengfeng Pan",
          "Ahmed Murtadha",
          "Bo Wen",
          "Yunfeng Liu"
        ],
        "section": "3.2.2 General form",
        "chunkIndex": 22,
        "totalChunks": 71
      }
    },
    {
      "id": "2104.09864v5-chunk-23",
      "content": "Long-term decay: Following Vaswani et al. [2017], we set θ i = 10000 -2 i/d . One can prove that this setting provides a long-term decay property (refer to Section (3.4.3) for more details), which means the inner-product will decay when the relative position increase. This property coincides with the intuition that a pair of tokens with a long relative distance should have less connection.\n\nRoPE with linear attention: The self-attention can be rewritten in a more general form.\n\n<!-- formula-not-decoded -->\n\nThe original self-attention chooses sim( q m , k n ) = exp( q ⊺ m k n / d ) . Note that the original self-attention should compute the inner product of query and key for every pair of tokens, which has a quadratic complexity O ( N 2 ) . Follow Katharopoulos et al. [2020], the linear attentions reformulate Equation (17) as\n\n<!-- formula-not-decoded -->",
      "metadata": {
        "source": "arxiv:2104.09864v5",
        "title": "RoFormer: Enhanced Transformer with Rotary Position Embedding",
        "authors": [
          "Jianlin Su",
          "Yu Lu",
          "Shengfeng Pan",
          "Ahmed Murtadha",
          "Bo Wen",
          "Yunfeng Liu"
        ],
        "section": "3.3 Properties of RoPE",
        "chunkIndex": 23,
        "totalChunks": 71
      }
    },
    {
      "id": "2104.09864v5-chunk-24",
      "content": "uery and key for every pair of tokens, which has a quadratic complexity O ( N 2 ) . Follow Katharopoulos et al. [2020], the linear attentions reformulate Equation (17) as\n\n<!-- formula-not-decoded -->\n\nwhere ϕ ( · ) , φ ( · ) are usually non-negative functions. The authors of Katharopoulos et al. [2020] have proposed ϕ ( x ) = φ ( x ) = elu( x )+1 and first computed the multiplication between keys and values using the associative property of matrix multiplication. A softmax function is used in Shen et al. [2021] to normalize queries and keys separately before the inner product, which is equivalent to ϕ ( q i ) = softmax( q i ) and ϕ ( k j ) = exp( k j ) . For more details about linear attention, we encourage readers to refer to original papers. In this section, we focus on discussing incorporating RoPE with Equation (18).",
      "metadata": {
        "source": "arxiv:2104.09864v5",
        "title": "RoFormer: Enhanced Transformer with Rotary Position Embedding",
        "authors": [
          "Jianlin Su",
          "Yu Lu",
          "Shengfeng Pan",
          "Ahmed Murtadha",
          "Bo Wen",
          "Yunfeng Liu"
        ],
        "section": "3.3 Properties of RoPE",
        "chunkIndex": 24,
        "totalChunks": 71
      }
    },
    {
      "id": "2104.09864v5-chunk-25",
      "content": ") and ϕ ( k j ) = exp( k j ) . For more details about linear attention, we encourage readers to refer to original papers. In this section, we focus on discussing incorporating RoPE with Equation (18). Since RoPE injects position information by rotation, which keeps the norm of hidden representations unchanged, we can combine RoPE with linear attention by multiplying the rotation matrix with the outputs of the non-negative functions.\n\n<!-- formula-not-decoded -->\n\nIt is noteworthy that we keep the denominator unchanged to avoid the risk of dividing zero, and the summation in the numerator could contain negative terms. Although the weights for each value v i in Equation (19) are not strictly probabilistic normalized, we kindly argue that the computation can still model the importance of values.",
      "metadata": {
        "source": "arxiv:2104.09864v5",
        "title": "RoFormer: Enhanced Transformer with Rotary Position Embedding",
        "authors": [
          "Jianlin Su",
          "Yu Lu",
          "Shengfeng Pan",
          "Ahmed Murtadha",
          "Bo Wen",
          "Yunfeng Liu"
        ],
        "section": "3.3 Properties of RoPE",
        "chunkIndex": 25,
        "totalChunks": 71
      }
    },
    {
      "id": "2104.09864v5-chunk-26",
      "content": "Under the case of d = 2 , we consider two-word embedding vectors x q , x k corresponds to query and key and their position m and n , respectively. According to eq. (1), their position-encoded counterparts are:\n\n<!-- formula-not-decoded -->\n\nwhere the subscripts of q m and k n indicate the encoded positions information. Assume that there exists a function g that defines the inner product between vectors produced by f { q,k } :\n\n<!-- formula-not-decoded -->\n\nwe further require below initial condition to be satisfied:\n\n<!-- formula-not-decoded -->\n\nwhich can be read as the vectors with empty position information encoded. Given these settings, we attempt to find a solution of f q , f k . First, we take advantage of the geometric meaning of vector in 2D and its complex counter part, decompose functions in Equations (20) and (21) into:\n\n<!-- formula-not-decoded -->",
      "metadata": {
        "source": "arxiv:2104.09864v5",
        "title": "RoFormer: Enhanced Transformer with Rotary Position Embedding",
        "authors": [
          "Jianlin Su",
          "Yu Lu",
          "Shengfeng Pan",
          "Ahmed Murtadha",
          "Bo Wen",
          "Yunfeng Liu"
        ],
        "section": "3.4.1 Derivation of RoPE under 2D",
        "chunkIndex": 26,
        "totalChunks": 71
      }
    },
    {
      "id": "2104.09864v5-chunk-27",
      "content": "lution of f q , f k . First, we take advantage of the geometric meaning of vector in 2D and its complex counter part, decompose functions in Equations (20) and (21) into:\n\n<!-- formula-not-decoded -->\n\nwhere R f , R g and Θ f , Θ g are the radical and angular components for f { q,k } and g , respectively. Plug them into Equation (21), we get the relation:\n\n<!-- formula-not-decoded -->\n\nwith the corresponding initial condition as:\n\n<!-- formula-not-decoded -->\n\nwhere ∥ q ∥ , ∥ k ∥ and θ q , θ k are the radial and angular part of q and k on the 2D plane.\n\nNext, we set m = n in Equation (24) and take into account initial conditions in Equation (25):\n\n<!-- formula-not-decoded -->\n\nOn one hand, from, a straightforward solution of R f could be formed from Equation (26a) :\n\n<!-- formula-not-decoded -->",
      "metadata": {
        "source": "arxiv:2104.09864v5",
        "title": "RoFormer: Enhanced Transformer with Rotary Position Embedding",
        "authors": [
          "Jianlin Su",
          "Yu Lu",
          "Shengfeng Pan",
          "Ahmed Murtadha",
          "Bo Wen",
          "Yunfeng Liu"
        ],
        "section": "3.4.1 Derivation of RoPE under 2D",
        "chunkIndex": 27,
        "totalChunks": 71
      }
    },
    {
      "id": "2104.09864v5-chunk-28",
      "content": "nto account initial conditions in Equation (25):\n\n<!-- formula-not-decoded -->\n\nOn one hand, from, a straightforward solution of R f could be formed from Equation (26a) :\n\n<!-- formula-not-decoded -->\n\nwhich interprets the radial functions R q , R k and R g are independent from the position information. On the other hand, as can be noticed in Equation (26b), Θ q ( x q , m ) -θ q = Θ k ( x k , m ) -θ k indicates that the angular functions does not dependent on query and key, we set them to Θ f := Θ q = Θ k and term Θ f ( x { q,k } , m ) -θ { q,k } is a function of position m and is independent of word embedding x { q,k } , we denote it as ϕ ( m ) , yielding:\n\n<!-- formula-not-decoded -->\n\nFurther, by plugging n = m +1 to Equation (24) and consider the above equation, we can get:\n\n<!-- formula-not-decoded -->\n\nSince RHS is a constant irrelevant to m , ϕ ( m ) with continuous integer inputs produce an arithmetic progression:\n\n<!-- formula-not-decoded -->",
      "metadata": {
        "source": "arxiv:2104.09864v5",
        "title": "RoFormer: Enhanced Transformer with Rotary Position Embedding",
        "authors": [
          "Jianlin Su",
          "Yu Lu",
          "Shengfeng Pan",
          "Ahmed Murtadha",
          "Bo Wen",
          "Yunfeng Liu"
        ],
        "section": "3.4.1 Derivation of RoPE under 2D",
        "chunkIndex": 28,
        "totalChunks": 71
      }
    },
    {
      "id": "2104.09864v5-chunk-29",
      "content": "e equation, we can get:\n\n<!-- formula-not-decoded -->\n\nSince RHS is a constant irrelevant to m , ϕ ( m ) with continuous integer inputs produce an arithmetic progression:\n\n<!-- formula-not-decoded -->\n\nwhere θ, γ ∈ R are constants and θ is non-zero. To summarize our solutions from Equations (27) to (30):\n\n<!-- formula-not-decoded -->\n\nNote that we do not apply any constrains to f q and f k of Equation (22), thus f q ( x m , 0) and f k ( x n , 0) are left to choose freely. To make our results comparable to Equation (3), we define:\n\n<!-- formula-not-decoded -->\n\nThen, we simply set γ = 0 in Equation (31) of the final solution:\n\n<!-- formula-not-decoded -->",
      "metadata": {
        "source": "arxiv:2104.09864v5",
        "title": "RoFormer: Enhanced Transformer with Rotary Position Embedding",
        "authors": [
          "Jianlin Su",
          "Yu Lu",
          "Shengfeng Pan",
          "Ahmed Murtadha",
          "Bo Wen",
          "Yunfeng Liu"
        ],
        "section": "3.4.1 Derivation of RoPE under 2D",
        "chunkIndex": 29,
        "totalChunks": 71
      }
    },
    {
      "id": "2104.09864v5-chunk-30",
      "content": "Taking the advantage of the sparsity of R d Θ ,m in Equation (15), a more computational efficient realization of a multiplication of R d Θ and x ∈ R d is:\n\n<!-- formula-not-decoded -->\n\nFigure 2: Long-term decay of RoPE.\n\n<!-- image -->",
      "metadata": {
        "source": "arxiv:2104.09864v5",
        "title": "RoFormer: Enhanced Transformer with Rotary Position Embedding",
        "authors": [
          "Jianlin Su",
          "Yu Lu",
          "Shengfeng Pan",
          "Ahmed Murtadha",
          "Bo Wen",
          "Yunfeng Liu"
        ],
        "section": "3.4.2 Computational efficient realization of rotary matrix multiplication",
        "chunkIndex": 30,
        "totalChunks": 71
      }
    },
    {
      "id": "2104.09864v5-chunk-31",
      "content": "We can group entries of vectors q = W q x m and k = W k x n in pairs, and the inner product of RoPE in Equation (16) can be written as a complex number multiplication.\n\n<!-- formula-not-decoded -->\n\nwhere q [2 i :2 i +1] represents the 2 i th to (2 i + 1) th entries of q . Denote h i = q [2 i :2 i +1] k ∗ [2 i :2 i +1] and S j = ∑ j -1 i =0 e i ( m -n ) θ i , and let h d/ 2 = 0 and S 0 = 0 , we can rewrite the summation using Abel transformation\n\n<!-- formula-not-decoded -->\n\nThus,\n\n<!-- formula-not-decoded -->\n\nNote that the value of 1 d/ 2 ∑ d/ 2 i =1 | S i | decay with the relative distance m -n increases by setting θ i = 10000 -2 i/d , as shown in Figure (2) .",
      "metadata": {
        "source": "arxiv:2104.09864v5",
        "title": "RoFormer: Enhanced Transformer with Rotary Position Embedding",
        "authors": [
          "Jianlin Su",
          "Yu Lu",
          "Shengfeng Pan",
          "Ahmed Murtadha",
          "Bo Wen",
          "Yunfeng Liu"
        ],
        "section": "3.4.3 Long-term decay of RoPE",
        "chunkIndex": 31,
        "totalChunks": 71
      }
    },
    {
      "id": "2104.09864v5-chunk-32",
      "content": "We evaluate the proposed RoFormer on various NLP tasks as follows. We validate the performance of the proposed solution on machine translation task Section (4.1) . Then, we compare our RoPE implementation with BERTDevlin et al. [2019] during the pre-training stage in Section (4.2) . Based on the pre-trained model, in Section (4.3) , we further carry out evaluations across different downstream tasks from GLUE benchmarksSingh et al. [2018]. In Addition, we conduct experiments using the proposed RoPE with the linear attention of PerFormer Choromanski et al. [2020] in\n\nTable 1: The proposed RoFormer gives better BLEU scores compared to its baseline alternative Vaswani et al. [2017] on the WMT 2014 English-to-German translation taskBojar et al. [2014].\n\n| Model                                 |   BLEU |\n|---------------------------------------|--------|\n| Transformer-baseVaswani et al. [2017] |   27.3 |\n| RoFormer                              |   27.5 |",
      "metadata": {
        "source": "arxiv:2104.09864v5",
        "title": "RoFormer: Enhanced Transformer with Rotary Position Embedding",
        "authors": [
          "Jianlin Su",
          "Yu Lu",
          "Shengfeng Pan",
          "Ahmed Murtadha",
          "Bo Wen",
          "Yunfeng Liu"
        ],
        "section": "4 Experiments and Evaluation",
        "chunkIndex": 32,
        "totalChunks": 71
      }
    },
    {
      "id": "2104.09864v5-chunk-33",
      "content": "odel                                 |   BLEU |\n|---------------------------------------|--------|\n| Transformer-baseVaswani et al. [2017] |   27.3 |\n| RoFormer                              |   27.5 |\n\nSection (4.4) . By the end, additional tests on Chinese data are included in Section (4.5) . All the experiments were run on two cloud severs with 4 x V100 GPUs.",
      "metadata": {
        "source": "arxiv:2104.09864v5",
        "title": "RoFormer: Enhanced Transformer with Rotary Position Embedding",
        "authors": [
          "Jianlin Su",
          "Yu Lu",
          "Shengfeng Pan",
          "Ahmed Murtadha",
          "Bo Wen",
          "Yunfeng Liu"
        ],
        "section": "4 Experiments and Evaluation",
        "chunkIndex": 33,
        "totalChunks": 71
      }
    },
    {
      "id": "2104.09864v5-chunk-34",
      "content": "We first demonstrate the performance of RoFormer on sequence-to-sequence language translation tasks.",
      "metadata": {
        "source": "arxiv:2104.09864v5",
        "title": "RoFormer: Enhanced Transformer with Rotary Position Embedding",
        "authors": [
          "Jianlin Su",
          "Yu Lu",
          "Shengfeng Pan",
          "Ahmed Murtadha",
          "Bo Wen",
          "Yunfeng Liu"
        ],
        "section": "4.1 Machine Translation",
        "chunkIndex": 34,
        "totalChunks": 71
      }
    },
    {
      "id": "2104.09864v5-chunk-35",
      "content": "We choose the standard WMT 2014 English-German datasetBojar et al. [2014], which consists of approximately 4.5 million sentence pairs. We compare to the transformer-based baseline alternative Vaswani et al. [2017].",
      "metadata": {
        "source": "arxiv:2104.09864v5",
        "title": "RoFormer: Enhanced Transformer with Rotary Position Embedding",
        "authors": [
          "Jianlin Su",
          "Yu Lu",
          "Shengfeng Pan",
          "Ahmed Murtadha",
          "Bo Wen",
          "Yunfeng Liu"
        ],
        "section": "4.1.1 Experimental Settings",
        "chunkIndex": 35,
        "totalChunks": 71
      }
    },
    {
      "id": "2104.09864v5-chunk-36",
      "content": "We carry out some modifications on self-attention layer of the baseline model Vaswani et al. [2017] to enable RoPE to its learning process. We replicate the setup for English-to-German translation with a vocabulary of 37k based on a joint source and target byte pair encoding(BPE)Sennrich et al. [2015]. During the evaluation, a single model is obtained by averaging the last 5 checkpoints. The result uses beam search with a beam size of 4 and length penalty 0.6. We implement the experiment in PyTorch in the fairseq toolkit (MIT License)Ott et al. [2019]. Our model is optimized with the Adam optimizer using β 1 = 0 . 9 , β 2 = 0 . 98 , learning rate is increased linearly from 1 e -7 to 5 e -4 and then decayed proportionally to the inverse square root of the step number. Label smoothing with 0.1 is also adopted. We report the BLEUPapineni et al. [2002] score on the test set as the final metric.",
      "metadata": {
        "source": "arxiv:2104.09864v5",
        "title": "RoFormer: Enhanced Transformer with Rotary Position Embedding",
        "authors": [
          "Jianlin Su",
          "Yu Lu",
          "Shengfeng Pan",
          "Ahmed Murtadha",
          "Bo Wen",
          "Yunfeng Liu"
        ],
        "section": "4.1.2 Implementation details",
        "chunkIndex": 36,
        "totalChunks": 71
      }
    },
    {
      "id": "2104.09864v5-chunk-37",
      "content": "We train the baseline model and our RoFormer under the same settings and report the results in Table (1) . As can be seen, our model gives better BLEU scores compared to the baseline Transformer.",
      "metadata": {
        "source": "arxiv:2104.09864v5",
        "title": "RoFormer: Enhanced Transformer with Rotary Position Embedding",
        "authors": [
          "Jianlin Su",
          "Yu Lu",
          "Shengfeng Pan",
          "Ahmed Murtadha",
          "Bo Wen",
          "Yunfeng Liu"
        ],
        "section": "4.1.3 Results",
        "chunkIndex": 37,
        "totalChunks": 71
      }
    },
    {
      "id": "2104.09864v5-chunk-38",
      "content": "The second experiment is to validate the performance of our proposal in terms of learning contextual representations. To achieve this, we replace the original sinusoidal position encoding of BERT with our RoPE during the pre-training step.",
      "metadata": {
        "source": "arxiv:2104.09864v5",
        "title": "RoFormer: Enhanced Transformer with Rotary Position Embedding",
        "authors": [
          "Jianlin Su",
          "Yu Lu",
          "Shengfeng Pan",
          "Ahmed Murtadha",
          "Bo Wen",
          "Yunfeng Liu"
        ],
        "section": "4.2 Pre-training Language Modeling",
        "chunkIndex": 38,
        "totalChunks": 71
      }
    },
    {
      "id": "2104.09864v5-chunk-39",
      "content": "We use the BookCorpus Zhu et al. [2015] and the Wikipedia Corpus Foundation [2021] from Huggingface Datasets library (Apache License 2.0) for pre-training. The corpus is further split into train and validation sets at 8:2 ratio. We use the masked language-modeling (MLM) loss values of the training process as an evaluation metric. The well-known BERT Devlin et al. [2019] is adopted as our baseline model. Note that we use bert-base-uncased in our experiments.",
      "metadata": {
        "source": "arxiv:2104.09864v5",
        "title": "RoFormer: Enhanced Transformer with Rotary Position Embedding",
        "authors": [
          "Jianlin Su",
          "Yu Lu",
          "Shengfeng Pan",
          "Ahmed Murtadha",
          "Bo Wen",
          "Yunfeng Liu"
        ],
        "section": "4.2.1 Experimental Settings",
        "chunkIndex": 39,
        "totalChunks": 71
      }
    },
    {
      "id": "2104.09864v5-chunk-40",
      "content": "For RoFormer, we replace the sinusoidal position encoding in the self-attention block of the baseline model with our proposed RoPE and realizes self-attention according to Equation (16). We train both BERT and RoFormer with batch size 64 and maximum sequence length of 512 for 100k steps. AdamW Loshchilov and Hutter [2017] is used as the optimizer with learning rate 1e-5.",
      "metadata": {
        "source": "arxiv:2104.09864v5",
        "title": "RoFormer: Enhanced Transformer with Rotary Position Embedding",
        "authors": [
          "Jianlin Su",
          "Yu Lu",
          "Shengfeng Pan",
          "Ahmed Murtadha",
          "Bo Wen",
          "Yunfeng Liu"
        ],
        "section": "4.2.2 Implementation details",
        "chunkIndex": 40,
        "totalChunks": 71
      }
    },
    {
      "id": "2104.09864v5-chunk-41",
      "content": "The MLM loss during pre-training is shown on the left plot of Figure (3) . Compare to the vanilla BERT, RoFormer experiences faster convergence.\n\nFigure 3: Evaluation of RoPE in language modeling pre-training. Left : training loss for BERT and RoFormer. Right : training loss for PerFormer with and without RoPE.\n\n<!-- image -->",
      "metadata": {
        "source": "arxiv:2104.09864v5",
        "title": "RoFormer: Enhanced Transformer with Rotary Position Embedding",
        "authors": [
          "Jianlin Su",
          "Yu Lu",
          "Shengfeng Pan",
          "Ahmed Murtadha",
          "Bo Wen",
          "Yunfeng Liu"
        ],
        "section": "4.2.3 Results",
        "chunkIndex": 41,
        "totalChunks": 71
      }
    },
    {
      "id": "2104.09864v5-chunk-42",
      "content": "Consistent with the previous experiments, we fine-tune the weights of our pre-trained RoFormer across various GLUE tasks in order to evaluate its generalization ability on the downstream NLP tasks.",
      "metadata": {
        "source": "arxiv:2104.09864v5",
        "title": "RoFormer: Enhanced Transformer with Rotary Position Embedding",
        "authors": [
          "Jianlin Su",
          "Yu Lu",
          "Shengfeng Pan",
          "Ahmed Murtadha",
          "Bo Wen",
          "Yunfeng Liu"
        ],
        "section": "4.3 Fine-tuning on GLUE tasks",
        "chunkIndex": 42,
        "totalChunks": 71
      }
    },
    {
      "id": "2104.09864v5-chunk-43",
      "content": "We look at several datasets from GLUE, i.e. MRPC Dolan and Brockett [2005], SST-2 Socher et al. [2013], QNLI Rajpurkar et al. [2016], STS-B Al-Natsheh [2017], QQP Chen et al. [2018b] and MNLI Williams et al. [2018]. We use F1-score for MRPC and QQP dataset, spearman correlation for STS-B, and accuracy for the remaining as the evaluation metrics.",
      "metadata": {
        "source": "arxiv:2104.09864v5",
        "title": "RoFormer: Enhanced Transformer with Rotary Position Embedding",
        "authors": [
          "Jianlin Su",
          "Yu Lu",
          "Shengfeng Pan",
          "Ahmed Murtadha",
          "Bo Wen",
          "Yunfeng Liu"
        ],
        "section": "4.3.1 Experimental Settings",
        "chunkIndex": 43,
        "totalChunks": 71
      }
    },
    {
      "id": "2104.09864v5-chunk-44",
      "content": "Weuse Huggingface Transformers library (Apache License 2.0)Wolf et al. [2020] to fine-tune each of the aforementioned downstream tasks for 3 epochs, with a maximum sequence length of 512, batch size of 32 and learning rates 2,3,4,5e-5. Following Devlin et al. [2019], we report the best-averaged results on the validation set.\n\nTable 2: Comparing RoFormer and BERT by fine tuning on downstream GLEU tasks.\n\n| Model                    |   MRPC |   SST-2 |   QNLI |   STS-B |   QQP | MNLI(m/mm)   |\n|--------------------------|--------|---------|--------|---------|-------|--------------|\n| BERTDevlin et al. [2019] |   88.9 |    93.5 |   90.5 |    85.8 |  71.2 | 84.6/83.4    |\n| RoFormer                 |   89.5 |    90.7 |   88   |    87   |  86.4 | 80.2/79.8    |",
      "metadata": {
        "source": "arxiv:2104.09864v5",
        "title": "RoFormer: Enhanced Transformer with Rotary Position Embedding",
        "authors": [
          "Jianlin Su",
          "Yu Lu",
          "Shengfeng Pan",
          "Ahmed Murtadha",
          "Bo Wen",
          "Yunfeng Liu"
        ],
        "section": "4.3.2 Implementation details",
        "chunkIndex": 44,
        "totalChunks": 71
      }
    },
    {
      "id": "2104.09864v5-chunk-45",
      "content": "The evaluation results of the fine-tuning tasks are reported in Table (2) . As can be seen, RoFormer can significantly outperform BERT in three out of six datasets, and the improvements are considerable.",
      "metadata": {
        "source": "arxiv:2104.09864v5",
        "title": "RoFormer: Enhanced Transformer with Rotary Position Embedding",
        "authors": [
          "Jianlin Su",
          "Yu Lu",
          "Shengfeng Pan",
          "Ahmed Murtadha",
          "Bo Wen",
          "Yunfeng Liu"
        ],
        "section": "4.3.3 Results",
        "chunkIndex": 45,
        "totalChunks": 71
      }
    },
    {
      "id": "2104.09864v5-chunk-46",
      "content": "Performer Choromanski et al. [2020] introduces an alternative attention mechanism, linear attention, which is designed to avoid quadratic computation cost that scales with input sequence length. As discussed in Section (3.3) , the proposed RoPE can be easily implemented in the PerFormer model to realize the relative position encoding while keeping its linearly scaled complexity in self-attention. We demonstrate its performance with the pre-training task of language modeling.",
      "metadata": {
        "source": "arxiv:2104.09864v5",
        "title": "RoFormer: Enhanced Transformer with Rotary Position Embedding",
        "authors": [
          "Jianlin Su",
          "Yu Lu",
          "Shengfeng Pan",
          "Ahmed Murtadha",
          "Bo Wen",
          "Yunfeng Liu"
        ],
        "section": "4.4 Performer with RoPE",
        "chunkIndex": 46,
        "totalChunks": 71
      }
    },
    {
      "id": "2104.09864v5-chunk-47",
      "content": "We carry out tests on the Enwik8 dataset Mahoney [2006], which is from English Wikipedia that includes markup, special characters and text in other languages in addition to English text. We incorporate RoPE into the 12 layer char-based PerFormer with 768 dimensions and 12 heads 2 . To better illustrate the efficacy of RoPE, we report the loss curves of the pre-training process with and without RoPE under the same settings, i.e., learning rate 1e-4, batch size 128 and a fixed maximum sequence length of 1024, etc.",
      "metadata": {
        "source": "arxiv:2104.09864v5",
        "title": "RoFormer: Enhanced Transformer with Rotary Position Embedding",
        "authors": [
          "Jianlin Su",
          "Yu Lu",
          "Shengfeng Pan",
          "Ahmed Murtadha",
          "Bo Wen",
          "Yunfeng Liu"
        ],
        "section": "4.4.1 Implementation details",
        "chunkIndex": 47,
        "totalChunks": 71
      }
    },
    {
      "id": "2104.09864v5-chunk-48",
      "content": "As shown on the right plot of Figure (3) , substituting RoPE into Performer leads to rapid convergence and lower loss under the same amount of training steps. These improvements, in addition to the linear complexity, make Performer more attractive.",
      "metadata": {
        "source": "arxiv:2104.09864v5",
        "title": "RoFormer: Enhanced Transformer with Rotary Position Embedding",
        "authors": [
          "Jianlin Su",
          "Yu Lu",
          "Shengfeng Pan",
          "Ahmed Murtadha",
          "Bo Wen",
          "Yunfeng Liu"
        ],
        "section": "4.4.2 Results",
        "chunkIndex": 48,
        "totalChunks": 71
      }
    },
    {
      "id": "2104.09864v5-chunk-49",
      "content": "In addition to experiments on English data, we show additional results on Chinese data. To validate the performance of RoFormer on long texts, we conduct experiments on long documents whose length exceeds 512 characters.",
      "metadata": {
        "source": "arxiv:2104.09864v5",
        "title": "RoFormer: Enhanced Transformer with Rotary Position Embedding",
        "authors": [
          "Jianlin Su",
          "Yu Lu",
          "Shengfeng Pan",
          "Ahmed Murtadha",
          "Bo Wen",
          "Yunfeng Liu"
        ],
        "section": "4.5 Evaluation on Chinese Data",
        "chunkIndex": 49,
        "totalChunks": 71
      }
    },
    {
      "id": "2104.09864v5-chunk-50",
      "content": "In these experiments, we carried out some modifications on WoBERT Su [2020] by replacing the absolute position embedding with our proposed RoPE. As a cross-comparison with other pre-trained Transformer-based models in Chinese, i.e. BERT Devlin et al. [2019], WoBERT Su [2020], and NEZHA Wei et al. [2019], we tabulate their tokenization level and position embedding information in Table (3) .\n\nTable 3: Cross-comparison between our RoFormer and other pre-trained models on Chinese data. 'abs' and 'rel' annotates absolute position embedding and relative position embedding, respectively.\n\n| Model              | BERTDevlin et al. [2019]   | WoBERTSu [2020]   | NEZHAWei et al. [2019]   | RoFormer   |\n|--------------------|----------------------------|-------------------|--------------------------|------------|\n| Tokenization level | char abs.                  | word abs.         | char rel.",
      "metadata": {
        "source": "arxiv:2104.09864v5",
        "title": "RoFormer: Enhanced Transformer with Rotary Position Embedding",
        "authors": [
          "Jianlin Su",
          "Yu Lu",
          "Shengfeng Pan",
          "Ahmed Murtadha",
          "Bo Wen",
          "Yunfeng Liu"
        ],
        "section": "4.5.1 Implementation",
        "chunkIndex": 50,
        "totalChunks": 71
      }
    },
    {
      "id": "2104.09864v5-chunk-51",
      "content": "er   |\n|--------------------|----------------------------|-------------------|--------------------------|------------|\n| Tokenization level | char abs.                  | word abs.         | char rel.                | word       |\n| Position embedding |                            |                   |                          | RoPE       |",
      "metadata": {
        "source": "arxiv:2104.09864v5",
        "title": "RoFormer: Enhanced Transformer with Rotary Position Embedding",
        "authors": [
          "Jianlin Su",
          "Yu Lu",
          "Shengfeng Pan",
          "Ahmed Murtadha",
          "Bo Wen",
          "Yunfeng Liu"
        ],
        "section": "4.5.1 Implementation",
        "chunkIndex": 51,
        "totalChunks": 71
      }
    },
    {
      "id": "2104.09864v5-chunk-52",
      "content": "We pre-train RoFormer on approximately 34GB of data collected from Chinese Wikipedia, news and forums. The pre-training is carried out in multiple stages with changing batch size and maximum input sequence length in order to adapt the model to various scenarios. As shown in Table (4) , the accuracy of RoFormer elevates with an increasing upper bound of sequence length, which demonstrates the ability of RoFormer in dealing with long texts. We claim that this is the attribute to the excellent generalizability of the proposed RoPE.\n\nTable 4: Pre-training strategy of RoFormer on Chinese dataset. The training procedure is divided into various consecutive stages. In each stage, we train the model with a specific combination of maximum sequence length and batch size.\n\n|   Stage |   Max seq length |   Batch size | Training steps   |   Loss | Accuracy   |\n|---------|------------------|--------------|------------------|--------|------------|\n|       1 |              512 |          256 | 200k",
      "metadata": {
        "source": "arxiv:2104.09864v5",
        "title": "RoFormer: Enhanced Transformer with Rotary Position Embedding",
        "authors": [
          "Jianlin Su",
          "Yu Lu",
          "Shengfeng Pan",
          "Ahmed Murtadha",
          "Bo Wen",
          "Yunfeng Liu"
        ],
        "section": "4.5.2 Pre-training",
        "chunkIndex": 52,
        "totalChunks": 71
      }
    },
    {
      "id": "2104.09864v5-chunk-53",
      "content": "|   Batch size | Training steps   |   Loss | Accuracy   |\n|---------|------------------|--------------|------------------|--------|------------|\n|       1 |              512 |          256 | 200k             |   1.73 | 65.0%      |\n|       2 |             1536 |          256 | 12.5k            |   1.61 | 66.8%      |\n|       3 |              256 |          256 | 120k             |   1.75 | 64.6%      |\n|       4 |              128 |          512 | 80k              |   1.83 | 63.4%      |\n|       5 |             1536 |          256 | 10k              |   1.58 | 67.4%      |\n|       6 |              512 |          512 | 30k              |   1.66 | 66.2%      |",
      "metadata": {
        "source": "arxiv:2104.09864v5",
        "title": "RoFormer: Enhanced Transformer with Rotary Position Embedding",
        "authors": [
          "Jianlin Su",
          "Yu Lu",
          "Shengfeng Pan",
          "Ahmed Murtadha",
          "Bo Wen",
          "Yunfeng Liu"
        ],
        "section": "4.5.2 Pre-training",
        "chunkIndex": 53,
        "totalChunks": 71
      }
    },
    {
      "id": "2104.09864v5-chunk-54",
      "content": "We choose Chinese AI and Law 2019 Similar Case Matching (CAIL2019-SCM)Xiao et al. [2019] dataset to illustrate the ability of RoFormer in dealing with long texts, i.e., semantic text matching. CAIL2019-SCM contains 8964 triplets\n\n2 For this experiment, we adopt code (MIT License) from https://github.com/lucidrains/performer-pytorch\n\nof cases published by the Supreme People's Court of China. The input triplet, denoted as (A, B and C), are fact descriptions of three cases. The task is to predict whether the pair (A, B) is closer than (A, C) under a predefined similarity measure. Note that existing methods mostly cannot perform significantly on CAIL2019-SCM dataset due to the length of documents (i.e., mostly more than 512 characters). We split train, validation and test sets based on the well-known ratio 6:2:2.",
      "metadata": {
        "source": "arxiv:2104.09864v5",
        "title": "RoFormer: Enhanced Transformer with Rotary Position Embedding",
        "authors": [
          "Jianlin Su",
          "Yu Lu",
          "Shengfeng Pan",
          "Ahmed Murtadha",
          "Bo Wen",
          "Yunfeng Liu"
        ],
        "section": "4.5.3 Downstream Tasks &amp; Dataset",
        "chunkIndex": 54,
        "totalChunks": 71
      }
    },
    {
      "id": "2104.09864v5-chunk-55",
      "content": "We apply the pre-trained RoFormer model to CAIL2019-SCM with different input lengths. The model is compared with the pre-trained BERT and WoBERT model on the same pre-training data, as shown in Table (5) . With short text cut-offs, i.e., 512, the result from RoFormer is comparable to WoBERT and is slightly better than the BERT implementation. However, when increasing the maximum input text length to 1024, RoFormer outperforms WoBERT by an absolute improvement of 1.5%.\n\nTable 5: Experiment results on CAIL2019-SCM task. Numbers in the first column denote the maximum cut-off sequence length. The results are presented in terms of percent accuracy.\n\n| Model         | Validation   | Test    |\n|---------------|--------------|---------|\n| BERT-512      | 64.13%       | 67.77%  |\n| WoBERT-512    | 64.07%       | 68.10%  |\n| RoFormer-512  | 64.13%       | 68.29%  |\n| RoFormer-1024 | 66.07 %      | 69.79 % |",
      "metadata": {
        "source": "arxiv:2104.09864v5",
        "title": "RoFormer: Enhanced Transformer with Rotary Position Embedding",
        "authors": [
          "Jianlin Su",
          "Yu Lu",
          "Shengfeng Pan",
          "Ahmed Murtadha",
          "Bo Wen",
          "Yunfeng Liu"
        ],
        "section": "4.5.4 Results",
        "chunkIndex": 55,
        "totalChunks": 71
      }
    },
    {
      "id": "2104.09864v5-chunk-56",
      "content": "Although we provide theoretical groundings as well as promising experimental justifications, our method is limited by following facts:\n\n- Despite the fact that we mathematically format the relative position relations as rotations under 2D sub-spaces, there lacks of thorough explanations on why it converges faster than baseline models that incorporates other position encoding strategies.\n- Although we have proved that our model has favourable property of long-term decay for intern-token products, Section (3.3) , which is similar to the existing position encoding mechanisms, our model shows superior performance on long texts than peer models, we have not come up with a faithful explanation.\n\nOur proposed RoFormer is built upon the Transformer-based infrastructure, which requires hardware resources for pre-training purpose.",
      "metadata": {
        "source": "arxiv:2104.09864v5",
        "title": "RoFormer: Enhanced Transformer with Rotary Position Embedding",
        "authors": [
          "Jianlin Su",
          "Yu Lu",
          "Shengfeng Pan",
          "Ahmed Murtadha",
          "Bo Wen",
          "Yunfeng Liu"
        ],
        "section": "4.5.5 Limitations of the work",
        "chunkIndex": 56,
        "totalChunks": 71
      }
    },
    {
      "id": "2104.09864v5-chunk-57",
      "content": "In this work, we proposed a new position embedding method that incorporates explicit relative position dependency in self-attention to enhance the performance of transformer architectures. Our theoretical analysis indicates that relative position can be naturally formulated using vector production in self-attention, with absolution position information being encoded through a rotation matrix. In addition, we mathematically illustrated the advantageous properties of the proposed method when applied to the Transformer. Finally, experiments on both English and Chinese benchmark datasets demonstrate that our method encourages faster convergence in pre-training. The experimental results also show that our proposed RoFormer can achieve better performance on long texts task.",
      "metadata": {
        "source": "arxiv:2104.09864v5",
        "title": "RoFormer: Enhanced Transformer with Rotary Position Embedding",
        "authors": [
          "Jianlin Su",
          "Yu Lu",
          "Shengfeng Pan",
          "Ahmed Murtadha",
          "Bo Wen",
          "Yunfeng Liu"
        ],
        "section": "5 Conclusions",
        "chunkIndex": 57,
        "totalChunks": 71
      }
    },
    {
      "id": "2104.09864v5-chunk-58",
      "content": "- Jonas Gehring, Michael Auli, David Grangier, Denis Yarats, and Yann N Dauphin. Convolutional sequence to sequence learning. In International Conference on Machine Learning , pages 1243-1252. PMLR, 2017.\n- Md. Amirul Islam, Sen Jia, and Neil D. B. Bruce. How much position information do convolutional neural networks encode? ArXiv , abs/2001.08248, 2020.\n- Ashish Vaswani, Noam Shazeer, Niki Parmar, Jakob Uszkoreit, Llion Jones, Aidan N Gomez, L ukasz Kaiser, and Illia Polosukhin. Attention is all you need. In I. Guyon, U. V. Luxburg, S. Bengio, H. Wallach, R. Fergus, S. Vishwanathan, and R. Garnett, editors, Advances in Neural Information Processing Systems ,\n\n- volume 30. Curran Associates, Inc., 2017. URL https://proceedings.neurips.cc/paper/2017/file/ 3f5ee243547dee91fbd053c1c4a845aa-Paper.pdf .\n- J. Devlin, Ming-Wei Chang, Kenton Lee, and Kristina Toutanova. Bert: Pre-training of deep bidirectional transformers for language understanding. In NAACL-HLT , 2019.\n- A.",
      "metadata": {
        "source": "arxiv:2104.09864v5",
        "title": "RoFormer: Enhanced Transformer with Rotary Position Embedding",
        "authors": [
          "Jianlin Su",
          "Yu Lu",
          "Shengfeng Pan",
          "Ahmed Murtadha",
          "Bo Wen",
          "Yunfeng Liu"
        ],
        "section": "References",
        "chunkIndex": 58,
        "totalChunks": 71
      }
    },
    {
      "id": "2104.09864v5-chunk-59",
      "content": "bd053c1c4a845aa-Paper.pdf .\n- J. Devlin, Ming-Wei Chang, Kenton Lee, and Kristina Toutanova. Bert: Pre-training of deep bidirectional transformers for language understanding. In NAACL-HLT , 2019.\n- A. Radford, Jeffrey Wu, R. Child, David Luan, Dario Amodei, and Ilya Sutskever. Language models are unsupervised multitask learners. 2019.\n- Chulhee Yun, Srinadh Bhojanapalli, Ankit Singh Rawat, Sashank Reddi, and Sanjiv Kumar. Are transformers universal approximators of sequence-to-sequence functions? In International Conference on Learning Representations , 2020. URL https://openreview.net/forum?id=ByxRM0Ntvr .\n- Zhenzhong Lan, Mingda Chen, Sebastian Goodman, Kevin Gimpel, Piyush Sharma, and Radu Soricut. Albert: A lite bert for self-supervised learning of language representations. In International Conference on Learning Representations , 2020. URL https://openreview.net/forum?id=H1eA7AEtvS .\n- Kevin Clark, Minh-Thang Luong, Quoc V. Le, and Christopher D. Manning.",
      "metadata": {
        "source": "arxiv:2104.09864v5",
        "title": "RoFormer: Enhanced Transformer with Rotary Position Embedding",
        "authors": [
          "Jianlin Su",
          "Yu Lu",
          "Shengfeng Pan",
          "Ahmed Murtadha",
          "Bo Wen",
          "Yunfeng Liu"
        ],
        "section": "References",
        "chunkIndex": 59,
        "totalChunks": 71
      }
    },
    {
      "id": "2104.09864v5-chunk-60",
      "content": "presentations. In International Conference on Learning Representations , 2020. URL https://openreview.net/forum?id=H1eA7AEtvS .\n- Kevin Clark, Minh-Thang Luong, Quoc V. Le, and Christopher D. Manning. ELECTRA: Pre-training text encoders as discriminators rather than generators. In ICLR , 2020. URL https://openreview.net/pdf?id=r1xMH1BtvB .\n- A. Radford and Karthik Narasimhan. Improving language understanding by generative pre-training. 2018.\n- Ankur P. Parikh, Oscar Täckström, Dipanjan Das, and Jakob Uszkoreit. A decomposable attention model for natural language inference. In EMNLP , 2016.\n- Peter Shaw, Jakob Uszkoreit, and Ashish Vaswani. Self-attention with relative position representations. In NAACL-HLT , 2018.\n- Cheng-Zhi Anna Huang, Ashish Vaswani, Jakob Uszkoreit, Noam Shazeer, I. Simon, C. Hawthorne, Andrew M. Dai, M. Hoffman, M. Dinculescu, and D. Eck. Music transformer. arXiv: Learning , 2018.\n- Zihang Dai, Z. Yang, Yiming Yang, J. Carbonell, Quoc V. Le, and R. Salakhutdinov.",
      "metadata": {
        "source": "arxiv:2104.09864v5",
        "title": "RoFormer: Enhanced Transformer with Rotary Position Embedding",
        "authors": [
          "Jianlin Su",
          "Yu Lu",
          "Shengfeng Pan",
          "Ahmed Murtadha",
          "Bo Wen",
          "Yunfeng Liu"
        ],
        "section": "References",
        "chunkIndex": 60,
        "totalChunks": 71
      }
    },
    {
      "id": "2104.09864v5-chunk-61",
      "content": "imon, C. Hawthorne, Andrew M. Dai, M. Hoffman, M. Dinculescu, and D. Eck. Music transformer. arXiv: Learning , 2018.\n- Zihang Dai, Z. Yang, Yiming Yang, J. Carbonell, Quoc V. Le, and R. Salakhutdinov. Transformer-xl: Attentive language models beyond a fixed-length context. In ACL , 2019.\n- Z. Yang, Zihang Dai, Yiming Yang, J. Carbonell, R. Salakhutdinov, and Quoc V. Le. Xlnet: Generalized autoregressive pretraining for language understanding. In NeurIPS , 2019.\n- Colin Raffel, Noam Shazeer, Adam Roberts, Katherine Lee, Sharan Narang, Michael Matena, Yanqi Zhou, W. Li, and Peter J. Liu. Exploring the limits of transfer learning with a unified text-to-text transformer. J. Mach. Learn. Res. , 21: 140:1-140:67, 2020.\n- Guolin Ke, Di He, and T. Liu. Rethinking positional encoding in language pre-training. ArXiv , abs/2006.15595, 2020.\n- Pengcheng He, Xiaodong Liu, Jianfeng Gao, and Weizhu Chen. Deberta: Decoding-enhanced bert with disentangled attention.",
      "metadata": {
        "source": "arxiv:2104.09864v5",
        "title": "RoFormer: Enhanced Transformer with Rotary Position Embedding",
        "authors": [
          "Jianlin Su",
          "Yu Lu",
          "Shengfeng Pan",
          "Ahmed Murtadha",
          "Bo Wen",
          "Yunfeng Liu"
        ],
        "section": "References",
        "chunkIndex": 61,
        "totalChunks": 71
      }
    },
    {
      "id": "2104.09864v5-chunk-62",
      "content": "ng positional encoding in language pre-training. ArXiv , abs/2006.15595, 2020.\n- Pengcheng He, Xiaodong Liu, Jianfeng Gao, and Weizhu Chen. Deberta: Decoding-enhanced bert with disentangled attention. ArXiv , abs/2006.03654, 2020.\n- Zhiheng Huang, Davis Liang, Peng Xu, and Bing Xiang. Improve transformer models with better relative position embeddings. In Findings of the Association for Computational Linguistics: EMNLP 2020 , pages 3327-3335, Online, November 2020. Association for Computational Linguistics. doi:10.18653/v1/2020.findings-emnlp.298. URL https://www.aclweb.org/anthology/2020.findings-emnlp.298 .\n- Xuanqing Liu, Hsiang-Fu Yu, Inderjit S. Dhillon, and Cho-Jui Hsieh. Learning to encode position for transformer with continuous dynamical model. In Proceedings of the 37th International Conference on Machine Learning, ICML 2020, 13-18 July 2020, Virtual Event , volume 119 of Proceedings of Machine Learning Research , pages 6327-6335. PMLR, 2020.",
      "metadata": {
        "source": "arxiv:2104.09864v5",
        "title": "RoFormer: Enhanced Transformer with Rotary Position Embedding",
        "authors": [
          "Jianlin Su",
          "Yu Lu",
          "Shengfeng Pan",
          "Ahmed Murtadha",
          "Bo Wen",
          "Yunfeng Liu"
        ],
        "section": "References",
        "chunkIndex": 62,
        "totalChunks": 71
      }
    },
    {
      "id": "2104.09864v5-chunk-63",
      "content": "Proceedings of the 37th International Conference on Machine Learning, ICML 2020, 13-18 July 2020, Virtual Event , volume 119 of Proceedings of Machine Learning Research , pages 6327-6335. PMLR, 2020. URL http://proceedings.mlr.press/v119/liu20n.html .\n- Tian Qi Chen, Yulia Rubanova, Jesse Bettencourt, and David Duvenaud. Neural ordinary differential equations. In Samy Bengio, Hanna M. Wallach, Hugo Larochelle, Kristen Grauman, Nicolò Cesa-Bianchi, and Roman Garnett, editors, Advances in Neural Information Processing Systems 31: Annual Conference on Neural Information Processing Systems 2018, NeurIPS 2018, December 3-8, 2018, Montréal, Canada , pages 6572-6583, 2018a. URL https: //proceedings.neurips.cc/paper/2018/hash/69386f6bb1dfed68692a24c8686939b9-Abstract.html .\n- Benyou Wang, Donghao Zhao, Christina Lioma, Qiuchi Li, Peng Zhang, and Jakob Grue Simonsen. Encoding word order in complex embeddings. In International Conference on Learning Representations , 2020.",
      "metadata": {
        "source": "arxiv:2104.09864v5",
        "title": "RoFormer: Enhanced Transformer with Rotary Position Embedding",
        "authors": [
          "Jianlin Su",
          "Yu Lu",
          "Shengfeng Pan",
          "Ahmed Murtadha",
          "Bo Wen",
          "Yunfeng Liu"
        ],
        "section": "References",
        "chunkIndex": 63,
        "totalChunks": 71
      }
    },
    {
      "id": "2104.09864v5-chunk-64",
      "content": "- Benyou Wang, Donghao Zhao, Christina Lioma, Qiuchi Li, Peng Zhang, and Jakob Grue Simonsen. Encoding word order in complex embeddings. In International Conference on Learning Representations , 2020. URL https://openreview.net/forum?id=Hke-WTVtwr .\n- Angelos Katharopoulos, Apoorv Vyas, Nikolaos Pappas, and François Fleuret. Transformers are rnns: Fast autoregressive transformers with linear attention. In International Conference on Machine Learning , pages 5156-5165. PMLR, 2020.\n- Zhuoran Shen, Mingyuan Zhang, Haiyu Zhao, Shuai Yi, and Hongsheng Li. Efficient attention: Attention with linear complexities. In Proceedings of the IEEE/CVF Winter Conference on Applications of Computer Vision , pages 3531-3539, 2021.\n\n- Amapreet Singh, Julian Michael, Felix Hill, Omer Levy, and Samuel Bowman. Glue: A multi-task benchmark and analysis platform for natural language understanding. 04 2018.\n- Krzysztof Choromanski, Valerii Likhosherstov, David Dohan, Xingyou Song, A.",
      "metadata": {
        "source": "arxiv:2104.09864v5",
        "title": "RoFormer: Enhanced Transformer with Rotary Position Embedding",
        "authors": [
          "Jianlin Su",
          "Yu Lu",
          "Shengfeng Pan",
          "Ahmed Murtadha",
          "Bo Wen",
          "Yunfeng Liu"
        ],
        "section": "References",
        "chunkIndex": 64,
        "totalChunks": 71
      }
    },
    {
      "id": "2104.09864v5-chunk-65",
      "content": "r Levy, and Samuel Bowman. Glue: A multi-task benchmark and analysis platform for natural language understanding. 04 2018.\n- Krzysztof Choromanski, Valerii Likhosherstov, David Dohan, Xingyou Song, A. Gane, Tamás Sarlós, Peter Hawkins, J. Davis, Afroz Mohiuddin, Lukasz Kaiser, David Belanger, Lucy J. Colwell, and Adrian Weller. Rethinking attention with performers. ArXiv , abs/2009.14794, 2020.\n- Ondrej Bojar, Christian Buck, Christian Federmann, Barry Haddow, Philipp Koehn, Johannes Leveling, Christof Monz, Pavel Pecina, Matt Post, Herve Saint-Amand, Radu Soricut, Lucia Specia, and Alevs Tamchyna. Findings of the 2014 workshop on statistical machine translation. pages 12-58, 06 2014. doi:10.3115/v1/W14-3302.\n- Rico Sennrich, Barry Haddow, and Alexandra Birch. Neural machine translation of rare words with subword units. 08 2015.\n- Myle Ott, Sergey Edunov, Alexei Baevski, Angela Fan, Sam Gross, Nathan Ng, David Grangier, and Michael Auli.",
      "metadata": {
        "source": "arxiv:2104.09864v5",
        "title": "RoFormer: Enhanced Transformer with Rotary Position Embedding",
        "authors": [
          "Jianlin Su",
          "Yu Lu",
          "Shengfeng Pan",
          "Ahmed Murtadha",
          "Bo Wen",
          "Yunfeng Liu"
        ],
        "section": "References",
        "chunkIndex": 65,
        "totalChunks": 71
      }
    },
    {
      "id": "2104.09864v5-chunk-66",
      "content": "nd Alexandra Birch. Neural machine translation of rare words with subword units. 08 2015.\n- Myle Ott, Sergey Edunov, Alexei Baevski, Angela Fan, Sam Gross, Nathan Ng, David Grangier, and Michael Auli. fairseq: A fast, extensible toolkit for sequence modeling. pages 48-53, 01 2019. doi:10.18653/v1/N19-4009.\n- Kishore Papineni, Salim Roukos, Todd Ward, and Wei Jing Zhu. Bleu: a method for automatic evaluation of machine translation. 10 2002. doi:10.3115/1073083.1073135.\n- Yukun Zhu, Ryan Kiros, Richard Zemel, Ruslan Salakhutdinov, Raquel Urtasun, Antonio Torralba, and Sanja Fidler. Aligning books and movies: Towards story-like visual explanations by watching movies and reading books. In arXiv preprint arXiv:1506.06724 , 2015.\n- Wikimedia Foundation. Wikimedia downloads, https://dumps.wikimedia.org , 2021.\n- Ilya Loshchilov and Frank Hutter. Decoupled Weight Decay Regularization. arXiv e-prints , art. arXiv:1711.05101, November 2017.\n- William B. Dolan and Chris Brockett.",
      "metadata": {
        "source": "arxiv:2104.09864v5",
        "title": "RoFormer: Enhanced Transformer with Rotary Position Embedding",
        "authors": [
          "Jianlin Su",
          "Yu Lu",
          "Shengfeng Pan",
          "Ahmed Murtadha",
          "Bo Wen",
          "Yunfeng Liu"
        ],
        "section": "References",
        "chunkIndex": 66,
        "totalChunks": 71
      }
    },
    {
      "id": "2104.09864v5-chunk-67",
      "content": "s://dumps.wikimedia.org , 2021.\n- Ilya Loshchilov and Frank Hutter. Decoupled Weight Decay Regularization. arXiv e-prints , art. arXiv:1711.05101, November 2017.\n- William B. Dolan and Chris Brockett. Automatically constructing a corpus of sentential paraphrases. In Proceedings of the Third International Workshop on Paraphrasing (IWP2005) , 2005. URL https://www.aclweb.org/ anthology/I05-5002 .\n- Richard Socher, A. Perelygin, J.Y. Wu, J. Chuang, C.D. Manning, A.Y. Ng, and C. Potts. Recursive deep models for semantic compositionality over a sentiment treebank. EMNLP , 1631:1631-1642, 01 2013.\n- Pranav Rajpurkar, Jian Zhang, Konstantin Lopyrev, and Percy Liang. Squad: 100,000+ questions for machine comprehension of text. pages 2383-2392, 01 2016. doi:10.18653/v1/D16-1264.\n- Hussein Al-Natsheh. Udl at semeval-2017 task 1: Semantic textual similarity estimation of english sentence pairs using regression model over pairwise features. 08 2017.\n- Z. Chen, H. Zhang, and L. Zhang, X.and Zhao.",
      "metadata": {
        "source": "arxiv:2104.09864v5",
        "title": "RoFormer: Enhanced Transformer with Rotary Position Embedding",
        "authors": [
          "Jianlin Su",
          "Yu Lu",
          "Shengfeng Pan",
          "Ahmed Murtadha",
          "Bo Wen",
          "Yunfeng Liu"
        ],
        "section": "References",
        "chunkIndex": 67,
        "totalChunks": 71
      }
    },
    {
      "id": "2104.09864v5-chunk-68",
      "content": "heh. Udl at semeval-2017 task 1: Semantic textual similarity estimation of english sentence pairs using regression model over pairwise features. 08 2017.\n- Z. Chen, H. Zhang, and L. Zhang, X.and Zhao. Quora question pairs., 2018b. URL https://www.kaggle.com/c/ quora-question-pairs .\n- Adina Williams, Nikita Nangia, and Samuel Bowman. A broad-coverage challenge corpus for sentence understanding through inference. pages 1112-1122, 01 2018. doi:10.18653/v1/N18-1101.\n- Thomas Wolf, Lysandre Debut, Victor Sanh, Julien Chaumond, Clement Delangue, Anthony Moi, Pierric Cistac, Tim Rault, Rémi Louf, Morgan Funtowicz, Joe Davison, Sam Shleifer, Patrick von Platen, Clara Ma, Yacine Jernite, Julien Plu, Canwen Xu, Teven Le Scao, Sylvain Gugger, Mariama Drame, Quentin Lhoest, and Alexander M. Rush. Transformers: State-of-the-art natural language processing.",
      "metadata": {
        "source": "arxiv:2104.09864v5",
        "title": "RoFormer: Enhanced Transformer with Rotary Position Embedding",
        "authors": [
          "Jianlin Su",
          "Yu Lu",
          "Shengfeng Pan",
          "Ahmed Murtadha",
          "Bo Wen",
          "Yunfeng Liu"
        ],
        "section": "References",
        "chunkIndex": 68,
        "totalChunks": 71
      }
    },
    {
      "id": "2104.09864v5-chunk-69",
      "content": "laten, Clara Ma, Yacine Jernite, Julien Plu, Canwen Xu, Teven Le Scao, Sylvain Gugger, Mariama Drame, Quentin Lhoest, and Alexander M. Rush. Transformers: State-of-the-art natural language processing. In Proceedings of the 2020 Conference on Empirical Methods in Natural Language Processing: System Demonstrations , pages 38-45, Online, October 2020. Association for Computational Linguistics. URL https://www.aclweb.org/anthology/2020.emnlp-demos.6 .\n- Matt Mahoney. Large text compression benchmark, http://www.mattmahoney.net/dc/text.html , 2006.\n- Jianlin Su. Wobert: Word-based chinese bert model - zhuiyiai. Technical report, 2020. URL https://github.com/ ZhuiyiTechnology/WoBERT .\n- Victor Junqiu Wei, Xiaozhe Ren, Xiaoguang Li, Wenyong Huang, Yi Liao, Yasheng Wang, Jiashu Lin, Xin Jiang, Xiao Chen, and Qun Liu. Nezha: Neural contextualized representation for chinese language understanding.",
      "metadata": {
        "source": "arxiv:2104.09864v5",
        "title": "RoFormer: Enhanced Transformer with Rotary Position Embedding",
        "authors": [
          "Jianlin Su",
          "Yu Lu",
          "Shengfeng Pan",
          "Ahmed Murtadha",
          "Bo Wen",
          "Yunfeng Liu"
        ],
        "section": "References",
        "chunkIndex": 69,
        "totalChunks": 71
      }
    },
    {
      "id": "2104.09864v5-chunk-70",
      "content": "qiu Wei, Xiaozhe Ren, Xiaoguang Li, Wenyong Huang, Yi Liao, Yasheng Wang, Jiashu Lin, Xin Jiang, Xiao Chen, and Qun Liu. Nezha: Neural contextualized representation for chinese language understanding. 08 2019.\n- Chaojun Xiao, Haoxi Zhong, Zhipeng Guo, Cunchao Tu, Zhiyuan Liu, Maosong Sun, Tianyang Zhang, Xianpei Han, Zhen hu, Heng Wang, and Jianfeng Xu. Cail2019-scm: A dataset of similar case matching in legal domain. 11 2019.",
      "metadata": {
        "source": "arxiv:2104.09864v5",
        "title": "RoFormer: Enhanced Transformer with Rotary Position Embedding",
        "authors": [
          "Jianlin Su",
          "Yu Lu",
          "Shengfeng Pan",
          "Ahmed Murtadha",
          "Bo Wen",
          "Yunfeng Liu"
        ],
        "section": "References",
        "chunkIndex": 70,
        "totalChunks": 71
      }
    }
  ],
  "fullText": "## ROFORMER: ENHANCED TRANSFORMER WITH ROTARY POSITION EMBEDDING\n\n## Jianlin Su\n\nZhuiyi Technology Co., Ltd. Shenzhen bojonesu@wezhuiyi.com\n\nAhmed Murtadha Zhuiyi Technology Co., Ltd. Shenzhen mengjiayi@wezhuiyi.com\n\n## Yu Lu\n\nZhuiyi Technology Co., Ltd. Shenzhen julianlu@wezhuiyi.com\n\nBo Wen Zhuiyi Technology Co., Ltd.\n\nShenzhen brucewen@wezhuiyi.com\n\nNovember 9, 2023\n\n## ABSTRACT\n\nPosition encoding recently has shown effective in the transformer architecture. It enables valuable supervision for dependency modeling between elements at different positions of the sequence. In this paper, we first investigate various methods to integrate positional information into the learning process of transformer-based language models. Then, we propose a novel method named Rotary Position Embedding(RoPE) to effectively leverage the positional information. Specifically, the proposed RoPE encodes the absolute position with a rotation matrix and meanwhile incorporates the explicit relative position dependency in self-attention formulation. Notably, RoPE enables valuable properties, including the flexibility of sequence length, decaying inter-token dependency with increasing relative distances, and the capability of equipping the linear self-attention with relative position encoding. Finally, we evaluate the enhanced transformer with rotary position embedding, also called RoFormer, on various long text classification benchmark datasets. Our experiments show that it consistently overcomes its alternatives. Furthermore, we provide a theoretical analysis to explain some experimental results. RoFormer is already integrated into Huggingface: https://huggingface.co/docs/transformers/model\\_doc/roformer .\n\nKeywords Pre-trained Language Models · Position Information Encoding · Pre-training · Natural Language Processing.\n\n## 1 Introduction\n\nThe sequential order of words is of great value to natural language understanding. Recurrent neural networks (RRNs) based models encode tokens' order by recursively computing a hidden state along the time dimension. Convolution neural networks (CNNs) based models (CNNs) Gehring et al. [2017] were typically considered position-agnostic, but recent work Islam et al. [2020] has shown that the commonly used padding operation can implicitly learn position information. Recently, the pre-trained language models (PLMs), which were built upon the transformer Vaswani et al. [2017], have achieved the state-of-the-art performance of various natural language processing (NLP) tasks, including context representation learning Devlin et al. [2019], machine translation Vaswani et al. [2017], and language modeling Radford et al. [2019], to name a few. Unlike, RRNs and CNNs-based models, PLMs utilize the self-attention mechanism to semantically capture the contextual representation of a given corpus. As a consequence, PLMs achieve a significant improvement in terms of parallelization over RNNs and improve the modeling ability of longer intra-token relations compared to CNNs 1 .\n\n1 A stack of multiple CNN layers can also capture longer intra-token relation, here we only consider single layer setting.\n\n## Shengfeng Pan\n\nZhuiyi Technology Co., Ltd. Shenzhen nickpan@wezhuiyi.com\n\nYunfeng Liu Zhuiyi Technology Co., Ltd. Shenzhen glenliu@wezhuiyi.com\n\nIt is noteworthy that the self-attention architecture of the current PLMs has shown to be position-agnostic Yun et al. [2020]. Following this claim, various approaches have been proposed to encode the position information into the learning process. On one side, generated absolute position encoding through a pre-defined function Vaswani et al. [2017] was added to the contextual representations, while a trainable absolute position encoding Gehring et al. [2017], Devlin et al. [2019], Lan et al. [2020], Clark et al. [2020], Radford et al. [2019], Radford and Narasimhan [2018]. On the other side, the previous work Parikh et al. [2016], Shaw et al. [2018], Huang et al. [2018], Dai et al. [2019], Yang et al. [2019], Raffel et al. [2020], Ke et al. [2020], He et al. [2020], Huang et al. [2020] focuses on relative position encoding, which typically encodes the relative position information into the attention mechanism. In addition to these approaches, the authors of Liu et al. [2020] have proposed to model the dependency of position encoding from the perspective of Neural ODE Chen et al. [2018a], and the authors of Wang et al. [2020] have proposed to model the position information in complex space. Despite the effectiveness of these approaches, they commonly add the position information to the context representation and thus render them unsuitable for the linear self-attention architecture.\n\nIn this paper, we introduce a novel method, namely Rotary Position Embedding(RoPE), to leverage the positional information into the learning process of PLMS. Specifically, RoPE encodes the absolute position with a rotation matrix and meanwhile incorporates the explicit relative position dependency in self-attention formulation. Note that the proposed RoPE is prioritized over the existing methods through valuable properties, including the sequence length flexibility, decaying inter-token dependency with increasing relative distances, and the capability of equipping the linear self-attention with relative position encoding. Experimental results on various long text classification benchmark datasets show that the enhanced transformer with rotary position embedding, namely RoFormer, can give better performance compared to baseline alternatives and thus demonstrates the efficacy of the proposed RoPE.\n\nIn brief, our contributions are three-folds as follows:\n\n- We investigated the existing approaches to the relative position encoding and found that they are mostly built based on the idea of the decomposition of adding position encoding to the context representations. We introduce a novel method, namely Rotary Position Embedding(RoPE), to leverage the positional information into the learning process of PLMS. The key idea is to encode relative position by multiplying the context representations with a rotation matrix with a clear theoretical interpretation.\n- We study the properties of RoPE and show that it decays with the relative distance increased, which is desired for natural language encoding. We kindly argue that previous relative position encoding-based approaches are not compatible with linear self-attention.\n- We evaluate the proposed RoFormer on various long text benchmark datasets. Our experiments show that it consistently achieves better performance compared to its alternatives. Some experiments with pre-trained language models are available on GitHub: https://github.com/ZhuiyiTechnology/roformer .\n\nThe remaining of the paper is organized as follows. We establish a formal description of the position encoding problem in self-attention architecture and revisit previous works in Section (2) . We then describe the rotary position encoding (RoPE) and study its properties in Section (3) . We report experiments in Section (4) . Finally, we conclude this paper in Section (5) .\n\n## 2 Background and Related Work\n\n## 2.1 Preliminary\n\nLet S N = { w i } N i =1 be a sequence of N input tokens with w i being the i th element. The corresponding word embedding of S N is denoted as E N = { x i } N i =1 , where x i ∈ R d is the d-dimensional word embedding vector of token w i without position information. The self-attention first incorporates position information to the word embeddings and transforms them into queries, keys, and value representations.\n\n<!-- formula-not-decoded -->\n\nwhere q m , k n and v n incorporate the m th and n th positions through f q , f k and f v , respectively. The query and key values are then used to compute the attention weights, while the output is computed as the weighted sum over the value\n\nrepresentation.\n\n<!-- formula-not-decoded -->\n\nThe existing approaches of transformer-based position encoding mainly focus on choosing a suitable function to form Equation (1).\n\n## 2.2 Absolute position embedding\n\nA typical choice of Equation (1) is\n\n<!-- formula-not-decoded -->\n\nwhere p i ∈ R d is a d-dimensional vector depending of the position of token x i . Previous work Devlin et al. [2019], Lan et al. [2020], Clark et al. [2020], Radford et al. [2019], Radford and Narasimhan [2018] introduced the use of a set of trainable vectors p i ∈ { p t } L t =1 , where L is the maximum sequence length. The authors of Vaswani et al. [2017] have proposed to generate p i using the sinusoidal function.\n\n<!-- formula-not-decoded -->\n\nin which p i, 2 t is the 2 t th element of the d-dimensional vector p i . In the next section, we show that our proposed RoPE is related to this intuition from the sinusoidal function perspective. However, instead of directly adding the position to the context representation, RoPE proposes to incorporate the relative position information by multiplying with the sinusoidal functions.\n\n## 2.3 Relative position embedding\n\nThe authors of Shaw et al. [2018] applied different settings of Equation (1) as following:\n\n<!-- formula-not-decoded -->\n\nwhere ˜ p k r , ˜ p v r ∈ R d are trainable relative position embeddings. Note that r = clip( m -n, r min , r max ) represents the relative distance between position m and n . They clipped the relative distance with the hypothesis that precise relative position information is not useful beyond a certain distance. Keeping the form of Equation (3), the authors Dai et al. [2019] have proposed to decompose q ⊺ m k n of Equation (2) as\n\n<!-- formula-not-decoded -->\n\nthe key idea is to replace the absolute position embedding p n with its sinusoid-encoded relative counterpart ˜ p m -n , while the absolute position p m in the third and fourth term with two trainable vectors u and v independent of the query positions. Further, W k is distinguished for the content-based and location-based key vectors x n and p n , denoted as W k and ˜ W k , resulting in:\n\n<!-- formula-not-decoded -->\n\nIt is noteworthy that the position information in the value term is removed by setting f v ( x j ) := W v x j . Later work Raffel et al. [2020], He et al. [2020], Ke et al. [2020], Huang et al. [2020] followed these settings by only encoding the relative position information into the attention weights. However, the authors of Raffel et al. [2020] reformed Equation (6) as:\n\n<!-- formula-not-decoded -->\n\nwhere b i,j is a trainable bias. The authors of Ke et al. [2020] investigated the middle two terms of Equation (6) and found little correlations between absolute positions and words. The authors of Raffel et al. [2020] proposed to model a pair of words or positions using different projection matrices.\n\n<!-- formula-not-decoded -->\n\nThe authors of He et al. [2020] argued that the relative positions of two tokens could only be fully modeled using the middle two terms of Equation (6). As a consequence, the absolute position embeddings p m and p n were simply replaced with the relative position embeddings ˜ p m -n :\n\n<!-- formula-not-decoded -->\n\nA comparison of the four variants of the relative position embeddings Radford and Narasimhan [2018] has shown that the variant similar to Equation (10) is the most efficient among the other three. Generally speaking, all these approaches attempt to modify Equation (6) based on the decomposition of Equation (3) under the self-attention settings in Equation (2), which was originally proposed in Vaswani et al. [2017]. They commonly introduced to directly add the position information to the context representations. Unlikely, our approach aims to derive the relative position encoding from Equation (1) under some constraints. Next, we show that the derived approach is more interpretable by incorporating relative position information with the rotation of context representations.\n\n## 3 Proposed approach\n\nIn this section, we discuss the proposed rotary position embedding (RoPE). We first formulate the relative position encoding problem in Section (3.1) , we then derive the RoPE in Section (3.2) and investigate its properties in Section (3.3) .\n\n## 3.1 Formulation\n\nTransformer-based language modeling usually leverages the position information of individual tokens through a selfattention mechanism. As can be observed in Equation (2), q ⊺ m k n typically enables knowledge conveyance between tokens at different positions. In order to incorporate relative position information, we require the inner product of query q m and key k n to be formulated by a function g , which takes only the word embeddings x m , x n , and their relative position m -n as input variables. In other words, we hope that the inner product encodes position information only in the relative form:\n\n<!-- formula-not-decoded -->\n\nThe ultimate goal is to find an equivalent encoding mechanism to solve the functions f q ( x m , m ) and f k ( x n , n ) to conform the aforementioned relation.\n\n## 3.2 Rotary position embedding\n\n## 3.2.1 A 2D case\n\nWe begin with a simple case with a dimension d = 2 . Under these settings, we make use of the geometric property of vectors on a 2D plane and its complex form to prove (refer Section (3.4.1) for more details) that a solution to our formulation Equation (11) is:\n\n<!-- formula-not-decoded -->\n\nwhere Re[ · ] is the real part of a complex number and ( W k x n ) ∗ represents the conjugate complex number of ( W k x n ) . θ ∈ R is a preset non-zero constant. We can further write f { q,k } in a multiplication matrix:\n\n<!-- formula-not-decoded -->\n\nwhere ( x (1) m , x (2) m ) is x m expressed in the 2D coordinates. Similarly, g can be viewed as a matrix and thus enables the solution of formulation in Section (3.1) under the 2D case. Specifically, incorporating the relative position embedding is straightforward: simply rotate the affine-transformed word embedding vector by amount of angle multiples of its position index and thus interprets the intuition behind Rotary Position Embedding .\n\n## 3.2.2 General form\n\nIn order to generalize our results in 2D to any x i ∈ R d where d is even, we divide the d-dimension space into d/ 2 sub-spaces and combine them in the merit of the linearity of the inner product, turning f { q,k } into:\n\n<!-- formula-not-decoded -->\n\nwhere\n\n<!-- formula-not-decoded -->\n\nis the rotary matrix with pre-defined parameters Θ = { θ i = 10000 -2( i -1) /d , i ∈ [1 , 2 , ..., d/ 2] } . A graphic illustration of RoPE is shown in Figure (1) . Applying our RoPE to self-attention in Equation (2), we obtain:\n\n<!-- formula-not-decoded -->\n\nwhere R d Θ ,n -m = ( R d Θ ,m ) ⊺ R d Θ ,n . Note that R d Θ is an orthogonal matrix, which ensures stability during the process of encoding position information. In addition, due to the sparsity of R d Θ , applying matrix multiplication directly as in Equation (16) is not computationally efficient; we provide another realization in theoretical explanation.\n\nIn contrast to the additive nature of position embedding method adopted in the previous works, i.e., Equations (3) to (10), our approach is multiplicative. Moreover, RoPE naturally incorporates relative position information through rotation matrix product instead of altering terms in the expanded formulation of additive position encoding when applied with self-attention.\n\nFigure 1: Implementation of Rotary Position Embedding(RoPE).\n\n<!-- image -->\n\n## 3.3 Properties of RoPE\n\nLong-term decay: Following Vaswani et al. [2017], we set θ i = 10000 -2 i/d . One can prove that this setting provides a long-term decay property (refer to Section (3.4.3) for more details), which means the inner-product will decay when the relative position increase. This property coincides with the intuition that a pair of tokens with a long relative distance should have less connection.\n\nRoPE with linear attention: The self-attention can be rewritten in a more general form.\n\n<!-- formula-not-decoded -->\n\nThe original self-attention chooses sim( q m , k n ) = exp( q ⊺ m k n / d ) . Note that the original self-attention should compute the inner product of query and key for every pair of tokens, which has a quadratic complexity O ( N 2 ) . Follow Katharopoulos et al. [2020], the linear attentions reformulate Equation (17) as\n\n<!-- formula-not-decoded -->\n\nwhere ϕ ( · ) , φ ( · ) are usually non-negative functions. The authors of Katharopoulos et al. [2020] have proposed ϕ ( x ) = φ ( x ) = elu( x )+1 and first computed the multiplication between keys and values using the associative property of matrix multiplication. A softmax function is used in Shen et al. [2021] to normalize queries and keys separately before the inner product, which is equivalent to ϕ ( q i ) = softmax( q i ) and ϕ ( k j ) = exp( k j ) . For more details about linear attention, we encourage readers to refer to original papers. In this section, we focus on discussing incorporating RoPE with Equation (18). Since RoPE injects position information by rotation, which keeps the norm of hidden representations unchanged, we can combine RoPE with linear attention by multiplying the rotation matrix with the outputs of the non-negative functions.\n\n<!-- formula-not-decoded -->\n\nIt is noteworthy that we keep the denominator unchanged to avoid the risk of dividing zero, and the summation in the numerator could contain negative terms. Although the weights for each value v i in Equation (19) are not strictly probabilistic normalized, we kindly argue that the computation can still model the importance of values.\n\n## 3.4 Theoretical Explanation\n\n## 3.4.1 Derivation of RoPE under 2D\n\nUnder the case of d = 2 , we consider two-word embedding vectors x q , x k corresponds to query and key and their position m and n , respectively. According to eq. (1), their position-encoded counterparts are:\n\n<!-- formula-not-decoded -->\n\nwhere the subscripts of q m and k n indicate the encoded positions information. Assume that there exists a function g that defines the inner product between vectors produced by f { q,k } :\n\n<!-- formula-not-decoded -->\n\nwe further require below initial condition to be satisfied:\n\n<!-- formula-not-decoded -->\n\nwhich can be read as the vectors with empty position information encoded. Given these settings, we attempt to find a solution of f q , f k . First, we take advantage of the geometric meaning of vector in 2D and its complex counter part, decompose functions in Equations (20) and (21) into:\n\n<!-- formula-not-decoded -->\n\nwhere R f , R g and Θ f , Θ g are the radical and angular components for f { q,k } and g , respectively. Plug them into Equation (21), we get the relation:\n\n<!-- formula-not-decoded -->\n\nwith the corresponding initial condition as:\n\n<!-- formula-not-decoded -->\n\nwhere ∥ q ∥ , ∥ k ∥ and θ q , θ k are the radial and angular part of q and k on the 2D plane.\n\nNext, we set m = n in Equation (24) and take into account initial conditions in Equation (25):\n\n<!-- formula-not-decoded -->\n\nOn one hand, from, a straightforward solution of R f could be formed from Equation (26a) :\n\n<!-- formula-not-decoded -->\n\nwhich interprets the radial functions R q , R k and R g are independent from the position information. On the other hand, as can be noticed in Equation (26b), Θ q ( x q , m ) -θ q = Θ k ( x k , m ) -θ k indicates that the angular functions does not dependent on query and key, we set them to Θ f := Θ q = Θ k and term Θ f ( x { q,k } , m ) -θ { q,k } is a function of position m and is independent of word embedding x { q,k } , we denote it as ϕ ( m ) , yielding:\n\n<!-- formula-not-decoded -->\n\nFurther, by plugging n = m +1 to Equation (24) and consider the above equation, we can get:\n\n<!-- formula-not-decoded -->\n\nSince RHS is a constant irrelevant to m , ϕ ( m ) with continuous integer inputs produce an arithmetic progression:\n\n<!-- formula-not-decoded -->\n\nwhere θ, γ ∈ R are constants and θ is non-zero. To summarize our solutions from Equations (27) to (30):\n\n<!-- formula-not-decoded -->\n\nNote that we do not apply any constrains to f q and f k of Equation (22), thus f q ( x m , 0) and f k ( x n , 0) are left to choose freely. To make our results comparable to Equation (3), we define:\n\n<!-- formula-not-decoded -->\n\nThen, we simply set γ = 0 in Equation (31) of the final solution:\n\n<!-- formula-not-decoded -->\n\n## 3.4.2 Computational efficient realization of rotary matrix multiplication\n\nTaking the advantage of the sparsity of R d Θ ,m in Equation (15), a more computational efficient realization of a multiplication of R d Θ and x ∈ R d is:\n\n<!-- formula-not-decoded -->\n\nFigure 2: Long-term decay of RoPE.\n\n<!-- image -->\n\n## 3.4.3 Long-term decay of RoPE\n\nWe can group entries of vectors q = W q x m and k = W k x n in pairs, and the inner product of RoPE in Equation (16) can be written as a complex number multiplication.\n\n<!-- formula-not-decoded -->\n\nwhere q [2 i :2 i +1] represents the 2 i th to (2 i + 1) th entries of q . Denote h i = q [2 i :2 i +1] k ∗ [2 i :2 i +1] and S j = ∑ j -1 i =0 e i ( m -n ) θ i , and let h d/ 2 = 0 and S 0 = 0 , we can rewrite the summation using Abel transformation\n\n<!-- formula-not-decoded -->\n\nThus,\n\n<!-- formula-not-decoded -->\n\nNote that the value of 1 d/ 2 ∑ d/ 2 i =1 | S i | decay with the relative distance m -n increases by setting θ i = 10000 -2 i/d , as shown in Figure (2) .\n\n## 4 Experiments and Evaluation\n\nWe evaluate the proposed RoFormer on various NLP tasks as follows. We validate the performance of the proposed solution on machine translation task Section (4.1) . Then, we compare our RoPE implementation with BERTDevlin et al. [2019] during the pre-training stage in Section (4.2) . Based on the pre-trained model, in Section (4.3) , we further carry out evaluations across different downstream tasks from GLUE benchmarksSingh et al. [2018]. In Addition, we conduct experiments using the proposed RoPE with the linear attention of PerFormer Choromanski et al. [2020] in\n\nTable 1: The proposed RoFormer gives better BLEU scores compared to its baseline alternative Vaswani et al. [2017] on the WMT 2014 English-to-German translation taskBojar et al. [2014].\n\n| Model                                 |   BLEU |\n|---------------------------------------|--------|\n| Transformer-baseVaswani et al. [2017] |   27.3 |\n| RoFormer                              |   27.5 |\n\nSection (4.4) . By the end, additional tests on Chinese data are included in Section (4.5) . All the experiments were run on two cloud severs with 4 x V100 GPUs.\n\n## 4.1 Machine Translation\n\nWe first demonstrate the performance of RoFormer on sequence-to-sequence language translation tasks.\n\n## 4.1.1 Experimental Settings\n\nWe choose the standard WMT 2014 English-German datasetBojar et al. [2014], which consists of approximately 4.5 million sentence pairs. We compare to the transformer-based baseline alternative Vaswani et al. [2017].\n\n## 4.1.2 Implementation details\n\nWe carry out some modifications on self-attention layer of the baseline model Vaswani et al. [2017] to enable RoPE to its learning process. We replicate the setup for English-to-German translation with a vocabulary of 37k based on a joint source and target byte pair encoding(BPE)Sennrich et al. [2015]. During the evaluation, a single model is obtained by averaging the last 5 checkpoints. The result uses beam search with a beam size of 4 and length penalty 0.6. We implement the experiment in PyTorch in the fairseq toolkit (MIT License)Ott et al. [2019]. Our model is optimized with the Adam optimizer using β 1 = 0 . 9 , β 2 = 0 . 98 , learning rate is increased linearly from 1 e -7 to 5 e -4 and then decayed proportionally to the inverse square root of the step number. Label smoothing with 0.1 is also adopted. We report the BLEUPapineni et al. [2002] score on the test set as the final metric.\n\n## 4.1.3 Results\n\nWe train the baseline model and our RoFormer under the same settings and report the results in Table (1) . As can be seen, our model gives better BLEU scores compared to the baseline Transformer.\n\n## 4.2 Pre-training Language Modeling\n\nThe second experiment is to validate the performance of our proposal in terms of learning contextual representations. To achieve this, we replace the original sinusoidal position encoding of BERT with our RoPE during the pre-training step.\n\n## 4.2.1 Experimental Settings\n\nWe use the BookCorpus Zhu et al. [2015] and the Wikipedia Corpus Foundation [2021] from Huggingface Datasets library (Apache License 2.0) for pre-training. The corpus is further split into train and validation sets at 8:2 ratio. We use the masked language-modeling (MLM) loss values of the training process as an evaluation metric. The well-known BERT Devlin et al. [2019] is adopted as our baseline model. Note that we use bert-base-uncased in our experiments.\n\n## 4.2.2 Implementation details\n\nFor RoFormer, we replace the sinusoidal position encoding in the self-attention block of the baseline model with our proposed RoPE and realizes self-attention according to Equation (16). We train both BERT and RoFormer with batch size 64 and maximum sequence length of 512 for 100k steps. AdamW Loshchilov and Hutter [2017] is used as the optimizer with learning rate 1e-5.\n\n## 4.2.3 Results\n\nThe MLM loss during pre-training is shown on the left plot of Figure (3) . Compare to the vanilla BERT, RoFormer experiences faster convergence.\n\nFigure 3: Evaluation of RoPE in language modeling pre-training. Left : training loss for BERT and RoFormer. Right : training loss for PerFormer with and without RoPE.\n\n<!-- image -->\n\n## 4.3 Fine-tuning on GLUE tasks\n\nConsistent with the previous experiments, we fine-tune the weights of our pre-trained RoFormer across various GLUE tasks in order to evaluate its generalization ability on the downstream NLP tasks.\n\n## 4.3.1 Experimental Settings\n\nWe look at several datasets from GLUE, i.e. MRPC Dolan and Brockett [2005], SST-2 Socher et al. [2013], QNLI Rajpurkar et al. [2016], STS-B Al-Natsheh [2017], QQP Chen et al. [2018b] and MNLI Williams et al. [2018]. We use F1-score for MRPC and QQP dataset, spearman correlation for STS-B, and accuracy for the remaining as the evaluation metrics.\n\n## 4.3.2 Implementation details\n\nWeuse Huggingface Transformers library (Apache License 2.0)Wolf et al. [2020] to fine-tune each of the aforementioned downstream tasks for 3 epochs, with a maximum sequence length of 512, batch size of 32 and learning rates 2,3,4,5e-5. Following Devlin et al. [2019], we report the best-averaged results on the validation set.\n\nTable 2: Comparing RoFormer and BERT by fine tuning on downstream GLEU tasks.\n\n| Model                    |   MRPC |   SST-2 |   QNLI |   STS-B |   QQP | MNLI(m/mm)   |\n|--------------------------|--------|---------|--------|---------|-------|--------------|\n| BERTDevlin et al. [2019] |   88.9 |    93.5 |   90.5 |    85.8 |  71.2 | 84.6/83.4    |\n| RoFormer                 |   89.5 |    90.7 |   88   |    87   |  86.4 | 80.2/79.8    |\n\n## 4.3.3 Results\n\nThe evaluation results of the fine-tuning tasks are reported in Table (2) . As can be seen, RoFormer can significantly outperform BERT in three out of six datasets, and the improvements are considerable.\n\n## 4.4 Performer with RoPE\n\nPerformer Choromanski et al. [2020] introduces an alternative attention mechanism, linear attention, which is designed to avoid quadratic computation cost that scales with input sequence length. As discussed in Section (3.3) , the proposed RoPE can be easily implemented in the PerFormer model to realize the relative position encoding while keeping its linearly scaled complexity in self-attention. We demonstrate its performance with the pre-training task of language modeling.\n\n## 4.4.1 Implementation details\n\nWe carry out tests on the Enwik8 dataset Mahoney [2006], which is from English Wikipedia that includes markup, special characters and text in other languages in addition to English text. We incorporate RoPE into the 12 layer char-based PerFormer with 768 dimensions and 12 heads 2 . To better illustrate the efficacy of RoPE, we report the loss curves of the pre-training process with and without RoPE under the same settings, i.e., learning rate 1e-4, batch size 128 and a fixed maximum sequence length of 1024, etc.\n\n## 4.4.2 Results\n\nAs shown on the right plot of Figure (3) , substituting RoPE into Performer leads to rapid convergence and lower loss under the same amount of training steps. These improvements, in addition to the linear complexity, make Performer more attractive.\n\n## 4.5 Evaluation on Chinese Data\n\nIn addition to experiments on English data, we show additional results on Chinese data. To validate the performance of RoFormer on long texts, we conduct experiments on long documents whose length exceeds 512 characters.\n\n## 4.5.1 Implementation\n\nIn these experiments, we carried out some modifications on WoBERT Su [2020] by replacing the absolute position embedding with our proposed RoPE. As a cross-comparison with other pre-trained Transformer-based models in Chinese, i.e. BERT Devlin et al. [2019], WoBERT Su [2020], and NEZHA Wei et al. [2019], we tabulate their tokenization level and position embedding information in Table (3) .\n\nTable 3: Cross-comparison between our RoFormer and other pre-trained models on Chinese data. 'abs' and 'rel' annotates absolute position embedding and relative position embedding, respectively.\n\n| Model              | BERTDevlin et al. [2019]   | WoBERTSu [2020]   | NEZHAWei et al. [2019]   | RoFormer   |\n|--------------------|----------------------------|-------------------|--------------------------|------------|\n| Tokenization level | char abs.                  | word abs.         | char rel.                | word       |\n| Position embedding |                            |                   |                          | RoPE       |\n\n## 4.5.2 Pre-training\n\nWe pre-train RoFormer on approximately 34GB of data collected from Chinese Wikipedia, news and forums. The pre-training is carried out in multiple stages with changing batch size and maximum input sequence length in order to adapt the model to various scenarios. As shown in Table (4) , the accuracy of RoFormer elevates with an increasing upper bound of sequence length, which demonstrates the ability of RoFormer in dealing with long texts. We claim that this is the attribute to the excellent generalizability of the proposed RoPE.\n\nTable 4: Pre-training strategy of RoFormer on Chinese dataset. The training procedure is divided into various consecutive stages. In each stage, we train the model with a specific combination of maximum sequence length and batch size.\n\n|   Stage |   Max seq length |   Batch size | Training steps   |   Loss | Accuracy   |\n|---------|------------------|--------------|------------------|--------|------------|\n|       1 |              512 |          256 | 200k             |   1.73 | 65.0%      |\n|       2 |             1536 |          256 | 12.5k            |   1.61 | 66.8%      |\n|       3 |              256 |          256 | 120k             |   1.75 | 64.6%      |\n|       4 |              128 |          512 | 80k              |   1.83 | 63.4%      |\n|       5 |             1536 |          256 | 10k              |   1.58 | 67.4%      |\n|       6 |              512 |          512 | 30k              |   1.66 | 66.2%      |\n\n## 4.5.3 Downstream Tasks &amp; Dataset\n\nWe choose Chinese AI and Law 2019 Similar Case Matching (CAIL2019-SCM)Xiao et al. [2019] dataset to illustrate the ability of RoFormer in dealing with long texts, i.e., semantic text matching. CAIL2019-SCM contains 8964 triplets\n\n2 For this experiment, we adopt code (MIT License) from https://github.com/lucidrains/performer-pytorch\n\nof cases published by the Supreme People's Court of China. The input triplet, denoted as (A, B and C), are fact descriptions of three cases. The task is to predict whether the pair (A, B) is closer than (A, C) under a predefined similarity measure. Note that existing methods mostly cannot perform significantly on CAIL2019-SCM dataset due to the length of documents (i.e., mostly more than 512 characters). We split train, validation and test sets based on the well-known ratio 6:2:2.\n\n## 4.5.4 Results\n\nWe apply the pre-trained RoFormer model to CAIL2019-SCM with different input lengths. The model is compared with the pre-trained BERT and WoBERT model on the same pre-training data, as shown in Table (5) . With short text cut-offs, i.e., 512, the result from RoFormer is comparable to WoBERT and is slightly better than the BERT implementation. However, when increasing the maximum input text length to 1024, RoFormer outperforms WoBERT by an absolute improvement of 1.5%.\n\nTable 5: Experiment results on CAIL2019-SCM task. Numbers in the first column denote the maximum cut-off sequence length. The results are presented in terms of percent accuracy.\n\n| Model         | Validation   | Test    |\n|---------------|--------------|---------|\n| BERT-512      | 64.13%       | 67.77%  |\n| WoBERT-512    | 64.07%       | 68.10%  |\n| RoFormer-512  | 64.13%       | 68.29%  |\n| RoFormer-1024 | 66.07 %      | 69.79 % |\n\n## 4.5.5 Limitations of the work\n\nAlthough we provide theoretical groundings as well as promising experimental justifications, our method is limited by following facts:\n\n- Despite the fact that we mathematically format the relative position relations as rotations under 2D sub-spaces, there lacks of thorough explanations on why it converges faster than baseline models that incorporates other position encoding strategies.\n- Although we have proved that our model has favourable property of long-term decay for intern-token products, Section (3.3) , which is similar to the existing position encoding mechanisms, our model shows superior performance on long texts than peer models, we have not come up with a faithful explanation.\n\nOur proposed RoFormer is built upon the Transformer-based infrastructure, which requires hardware resources for pre-training purpose.\n\n## 5 Conclusions\n\nIn this work, we proposed a new position embedding method that incorporates explicit relative position dependency in self-attention to enhance the performance of transformer architectures. Our theoretical analysis indicates that relative position can be naturally formulated using vector production in self-attention, with absolution position information being encoded through a rotation matrix. In addition, we mathematically illustrated the advantageous properties of the proposed method when applied to the Transformer. Finally, experiments on both English and Chinese benchmark datasets demonstrate that our method encourages faster convergence in pre-training. The experimental results also show that our proposed RoFormer can achieve better performance on long texts task.\n\n## References\n\n- Jonas Gehring, Michael Auli, David Grangier, Denis Yarats, and Yann N Dauphin. Convolutional sequence to sequence learning. In International Conference on Machine Learning , pages 1243-1252. PMLR, 2017.\n- Md. Amirul Islam, Sen Jia, and Neil D. B. Bruce. How much position information do convolutional neural networks encode? ArXiv , abs/2001.08248, 2020.\n- Ashish Vaswani, Noam Shazeer, Niki Parmar, Jakob Uszkoreit, Llion Jones, Aidan N Gomez, L ukasz Kaiser, and Illia Polosukhin. Attention is all you need. In I. Guyon, U. V. Luxburg, S. Bengio, H. Wallach, R. Fergus, S. Vishwanathan, and R. Garnett, editors, Advances in Neural Information Processing Systems ,\n\n- volume 30. Curran Associates, Inc., 2017. URL https://proceedings.neurips.cc/paper/2017/file/ 3f5ee243547dee91fbd053c1c4a845aa-Paper.pdf .\n- J. Devlin, Ming-Wei Chang, Kenton Lee, and Kristina Toutanova. Bert: Pre-training of deep bidirectional transformers for language understanding. In NAACL-HLT , 2019.\n- A. Radford, Jeffrey Wu, R. Child, David Luan, Dario Amodei, and Ilya Sutskever. Language models are unsupervised multitask learners. 2019.\n- Chulhee Yun, Srinadh Bhojanapalli, Ankit Singh Rawat, Sashank Reddi, and Sanjiv Kumar. Are transformers universal approximators of sequence-to-sequence functions? In International Conference on Learning Representations , 2020. URL https://openreview.net/forum?id=ByxRM0Ntvr .\n- Zhenzhong Lan, Mingda Chen, Sebastian Goodman, Kevin Gimpel, Piyush Sharma, and Radu Soricut. Albert: A lite bert for self-supervised learning of language representations. In International Conference on Learning Representations , 2020. URL https://openreview.net/forum?id=H1eA7AEtvS .\n- Kevin Clark, Minh-Thang Luong, Quoc V. Le, and Christopher D. Manning. ELECTRA: Pre-training text encoders as discriminators rather than generators. In ICLR , 2020. URL https://openreview.net/pdf?id=r1xMH1BtvB .\n- A. Radford and Karthik Narasimhan. Improving language understanding by generative pre-training. 2018.\n- Ankur P. Parikh, Oscar Täckström, Dipanjan Das, and Jakob Uszkoreit. A decomposable attention model for natural language inference. In EMNLP , 2016.\n- Peter Shaw, Jakob Uszkoreit, and Ashish Vaswani. Self-attention with relative position representations. In NAACL-HLT , 2018.\n- Cheng-Zhi Anna Huang, Ashish Vaswani, Jakob Uszkoreit, Noam Shazeer, I. Simon, C. Hawthorne, Andrew M. Dai, M. Hoffman, M. Dinculescu, and D. Eck. Music transformer. arXiv: Learning , 2018.\n- Zihang Dai, Z. Yang, Yiming Yang, J. Carbonell, Quoc V. Le, and R. Salakhutdinov. Transformer-xl: Attentive language models beyond a fixed-length context. In ACL , 2019.\n- Z. Yang, Zihang Dai, Yiming Yang, J. Carbonell, R. Salakhutdinov, and Quoc V. Le. Xlnet: Generalized autoregressive pretraining for language understanding. In NeurIPS , 2019.\n- Colin Raffel, Noam Shazeer, Adam Roberts, Katherine Lee, Sharan Narang, Michael Matena, Yanqi Zhou, W. Li, and Peter J. Liu. Exploring the limits of transfer learning with a unified text-to-text transformer. J. Mach. Learn. Res. , 21: 140:1-140:67, 2020.\n- Guolin Ke, Di He, and T. Liu. Rethinking positional encoding in language pre-training. ArXiv , abs/2006.15595, 2020.\n- Pengcheng He, Xiaodong Liu, Jianfeng Gao, and Weizhu Chen. Deberta: Decoding-enhanced bert with disentangled attention. ArXiv , abs/2006.03654, 2020.\n- Zhiheng Huang, Davis Liang, Peng Xu, and Bing Xiang. Improve transformer models with better relative position embeddings. In Findings of the Association for Computational Linguistics: EMNLP 2020 , pages 3327-3335, Online, November 2020. Association for Computational Linguistics. doi:10.18653/v1/2020.findings-emnlp.298. URL https://www.aclweb.org/anthology/2020.findings-emnlp.298 .\n- Xuanqing Liu, Hsiang-Fu Yu, Inderjit S. Dhillon, and Cho-Jui Hsieh. Learning to encode position for transformer with continuous dynamical model. In Proceedings of the 37th International Conference on Machine Learning, ICML 2020, 13-18 July 2020, Virtual Event , volume 119 of Proceedings of Machine Learning Research , pages 6327-6335. PMLR, 2020. URL http://proceedings.mlr.press/v119/liu20n.html .\n- Tian Qi Chen, Yulia Rubanova, Jesse Bettencourt, and David Duvenaud. Neural ordinary differential equations. In Samy Bengio, Hanna M. Wallach, Hugo Larochelle, Kristen Grauman, Nicolò Cesa-Bianchi, and Roman Garnett, editors, Advances in Neural Information Processing Systems 31: Annual Conference on Neural Information Processing Systems 2018, NeurIPS 2018, December 3-8, 2018, Montréal, Canada , pages 6572-6583, 2018a. URL https: //proceedings.neurips.cc/paper/2018/hash/69386f6bb1dfed68692a24c8686939b9-Abstract.html .\n- Benyou Wang, Donghao Zhao, Christina Lioma, Qiuchi Li, Peng Zhang, and Jakob Grue Simonsen. Encoding word order in complex embeddings. In International Conference on Learning Representations , 2020. URL https://openreview.net/forum?id=Hke-WTVtwr .\n- Angelos Katharopoulos, Apoorv Vyas, Nikolaos Pappas, and François Fleuret. Transformers are rnns: Fast autoregressive transformers with linear attention. In International Conference on Machine Learning , pages 5156-5165. PMLR, 2020.\n- Zhuoran Shen, Mingyuan Zhang, Haiyu Zhao, Shuai Yi, and Hongsheng Li. Efficient attention: Attention with linear complexities. In Proceedings of the IEEE/CVF Winter Conference on Applications of Computer Vision , pages 3531-3539, 2021.\n\n- Amapreet Singh, Julian Michael, Felix Hill, Omer Levy, and Samuel Bowman. Glue: A multi-task benchmark and analysis platform for natural language understanding. 04 2018.\n- Krzysztof Choromanski, Valerii Likhosherstov, David Dohan, Xingyou Song, A. Gane, Tamás Sarlós, Peter Hawkins, J. Davis, Afroz Mohiuddin, Lukasz Kaiser, David Belanger, Lucy J. Colwell, and Adrian Weller. Rethinking attention with performers. ArXiv , abs/2009.14794, 2020.\n- Ondrej Bojar, Christian Buck, Christian Federmann, Barry Haddow, Philipp Koehn, Johannes Leveling, Christof Monz, Pavel Pecina, Matt Post, Herve Saint-Amand, Radu Soricut, Lucia Specia, and Alevs Tamchyna. Findings of the 2014 workshop on statistical machine translation. pages 12-58, 06 2014. doi:10.3115/v1/W14-3302.\n- Rico Sennrich, Barry Haddow, and Alexandra Birch. Neural machine translation of rare words with subword units. 08 2015.\n- Myle Ott, Sergey Edunov, Alexei Baevski, Angela Fan, Sam Gross, Nathan Ng, David Grangier, and Michael Auli. fairseq: A fast, extensible toolkit for sequence modeling. pages 48-53, 01 2019. doi:10.18653/v1/N19-4009.\n- Kishore Papineni, Salim Roukos, Todd Ward, and Wei Jing Zhu. Bleu: a method for automatic evaluation of machine translation. 10 2002. doi:10.3115/1073083.1073135.\n- Yukun Zhu, Ryan Kiros, Richard Zemel, Ruslan Salakhutdinov, Raquel Urtasun, Antonio Torralba, and Sanja Fidler. Aligning books and movies: Towards story-like visual explanations by watching movies and reading books. In arXiv preprint arXiv:1506.06724 , 2015.\n- Wikimedia Foundation. Wikimedia downloads, https://dumps.wikimedia.org , 2021.\n- Ilya Loshchilov and Frank Hutter. Decoupled Weight Decay Regularization. arXiv e-prints , art. arXiv:1711.05101, November 2017.\n- William B. Dolan and Chris Brockett. Automatically constructing a corpus of sentential paraphrases. In Proceedings of the Third International Workshop on Paraphrasing (IWP2005) , 2005. URL https://www.aclweb.org/ anthology/I05-5002 .\n- Richard Socher, A. Perelygin, J.Y. Wu, J. Chuang, C.D. Manning, A.Y. Ng, and C. Potts. Recursive deep models for semantic compositionality over a sentiment treebank. EMNLP , 1631:1631-1642, 01 2013.\n- Pranav Rajpurkar, Jian Zhang, Konstantin Lopyrev, and Percy Liang. Squad: 100,000+ questions for machine comprehension of text. pages 2383-2392, 01 2016. doi:10.18653/v1/D16-1264.\n- Hussein Al-Natsheh. Udl at semeval-2017 task 1: Semantic textual similarity estimation of english sentence pairs using regression model over pairwise features. 08 2017.\n- Z. Chen, H. Zhang, and L. Zhang, X.and Zhao. Quora question pairs., 2018b. URL https://www.kaggle.com/c/ quora-question-pairs .\n- Adina Williams, Nikita Nangia, and Samuel Bowman. A broad-coverage challenge corpus for sentence understanding through inference. pages 1112-1122, 01 2018. doi:10.18653/v1/N18-1101.\n- Thomas Wolf, Lysandre Debut, Victor Sanh, Julien Chaumond, Clement Delangue, Anthony Moi, Pierric Cistac, Tim Rault, Rémi Louf, Morgan Funtowicz, Joe Davison, Sam Shleifer, Patrick von Platen, Clara Ma, Yacine Jernite, Julien Plu, Canwen Xu, Teven Le Scao, Sylvain Gugger, Mariama Drame, Quentin Lhoest, and Alexander M. Rush. Transformers: State-of-the-art natural language processing. In Proceedings of the 2020 Conference on Empirical Methods in Natural Language Processing: System Demonstrations , pages 38-45, Online, October 2020. Association for Computational Linguistics. URL https://www.aclweb.org/anthology/2020.emnlp-demos.6 .\n- Matt Mahoney. Large text compression benchmark, http://www.mattmahoney.net/dc/text.html , 2006.\n- Jianlin Su. Wobert: Word-based chinese bert model - zhuiyiai. Technical report, 2020. URL https://github.com/ ZhuiyiTechnology/WoBERT .\n- Victor Junqiu Wei, Xiaozhe Ren, Xiaoguang Li, Wenyong Huang, Yi Liao, Yasheng Wang, Jiashu Lin, Xin Jiang, Xiao Chen, and Qun Liu. Nezha: Neural contextualized representation for chinese language understanding. 08 2019.\n- Chaojun Xiao, Haoxi Zhong, Zhipeng Guo, Cunchao Tu, Zhiyuan Liu, Maosong Sun, Tianyang Zhang, Xianpei Han, Zhen hu, Heng Wang, and Jianfeng Xu. Cail2019-scm: A dataset of similar case matching in legal domain. 11 2019.",
  "tables": [
    {
      "index": 0,
      "markdown": "| Model                                 |   BLEU |\n|---------------------------------------|--------|\n| Transformer-baseVaswani et al. [2017] |   27.3 |\n| RoFormer                              |   27.5 |"
    },
    {
      "index": 1,
      "markdown": "| Model                    |   MRPC |   SST-2 |   QNLI |   STS-B |   QQP | MNLI(m/mm)   |\n|--------------------------|--------|---------|--------|---------|-------|--------------|\n| BERTDevlin et al. [2019] |   88.9 |    93.5 |   90.5 |    85.8 |  71.2 | 84.6/83.4    |\n| RoFormer                 |   89.5 |    90.7 |   88   |    87   |  86.4 | 80.2/79.8    |"
    },
    {
      "index": 2,
      "markdown": "| Model              | BERTDevlin et al. [2019]   | WoBERTSu [2020]   | NEZHAWei et al. [2019]   | RoFormer   |\n|--------------------|----------------------------|-------------------|--------------------------|------------|\n| Tokenization level | char abs.                  | word abs.         | char rel.                | word       |\n| Position embedding |                            |                   |                          | RoPE       |"
    },
    {
      "index": 3,
      "markdown": "|   Stage |   Max seq length |   Batch size | Training steps   |   Loss | Accuracy   |\n|---------|------------------|--------------|------------------|--------|------------|\n|       1 |              512 |          256 | 200k             |   1.73 | 65.0%      |\n|       2 |             1536 |          256 | 12.5k            |   1.61 | 66.8%      |\n|       3 |              256 |          256 | 120k             |   1.75 | 64.6%      |\n|       4 |              128 |          512 | 80k              |   1.83 | 63.4%      |\n|       5 |             1536 |          256 | 10k              |   1.58 | 67.4%      |\n|       6 |              512 |          512 | 30k              |   1.66 | 66.2%      |"
    },
    {
      "index": 4,
      "markdown": "| Model         | Validation   | Test    |\n|---------------|--------------|---------|\n| BERT-512      | 64.13%       | 67.77%  |\n| WoBERT-512    | 64.07%       | 68.10%  |\n| RoFormer-512  | 64.13%       | 68.29%  |\n| RoFormer-1024 | 66.07 %      | 69.79 % |"
    }
  ],
  "stats": {
    "pages": 14,
    "chunksCreated": 71,
    "totalCharacters": 44357,
    "totalWords": 6877,
    "numTables": 5,
    "processingTimeMs": 18907
  }
}